espressif/arduino-esp32/boards.txt
esp32wrover.menu.EraseFlash.none=Disabled
esp32wrover.menu.EraseFlash.none.upload.erase_cmd=
esp32wrover.menu.EraseFlash.all=Enabled
esp32wrover.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

pico32.name=ESP32 PICO-D4

pico32.bootloader.tool=esptool_py
pico32.bootloader.tool.default=esptool_py

pico32.upload.tool=esptool_py
pico32.upload.tool.default=esptool_py
pico32.upload.tool.network=esp_ota

pico32.upload.maximum_size=1310720
pico32.upload.maximum_data_size=327680
pico32.upload.flags=
pico32.upload.extra_flags=

pico32.serial.disableDTR=true
pico32.serial.disableRTS=true

pico32.build.tarch=xtensa
pico32.build.bootloader_addr=0x1000
pico32.build.target=esp32
pico32.build.mcu=esp32
pico32.build.core=esp32
pico32.build.variant=pico32
pico32.build.board=ESP32_PICO

pico32.build.f_cpu=240000000L
pico32.build.flash_size=4MB
pico32.build.flash_freq=80m
pico32.build.flash_mode=dio
pico32.build.boot=dio
pico32.build.partitions=default
pico32.build.defines=

pico32.menu.PartitionScheme.default=Default
pico32.menu.PartitionScheme.default.build.partitions=default
pico32.menu.PartitionScheme.no_ota=No OTA (Large APP)
pico32.menu.PartitionScheme.no_ota.build.partitions=no_ota
pico32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
pico32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
pico32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
pico32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
pico32.menu.PartitionScheme.custom=Custom
pico32.menu.PartitionScheme.custom.build.partitions=
pico32.menu.PartitionScheme.custom.upload.maximum_size=16777216

pico32.menu.UploadSpeed.921600=921600
pico32.menu.UploadSpeed.921600.upload.speed=921600
pico32.menu.UploadSpeed.115200=115200
pico32.menu.UploadSpeed.115200.upload.speed=115200
pico32.menu.UploadSpeed.256000.windows=256000
pico32.menu.UploadSpeed.256000.upload.speed=256000
pico32.menu.UploadSpeed.230400.windows.upload.speed=256000
pico32.menu.UploadSpeed.230400=230400
pico32.menu.UploadSpeed.230400.upload.speed=230400
pico32.menu.UploadSpeed.460800.linux=460800
pico32.menu.UploadSpeed.460800.macosx=460800
pico32.menu.UploadSpeed.460800.upload.speed=460800
pico32.menu.UploadSpeed.512000.windows=512000
pico32.menu.UploadSpeed.512000.upload.speed=512000

pico32.menu.DebugLevel.none=None
pico32.menu.DebugLevel.none.build.code_debug=0
pico32.menu.DebugLevel.error=Error
pico32.menu.DebugLevel.error.build.code_debug=1
pico32.menu.DebugLevel.warn=Warn
pico32.menu.DebugLevel.warn.build.code_debug=2
pico32.menu.DebugLevel.info=Info
pico32.menu.DebugLevel.info.build.code_debug=3
pico32.menu.DebugLevel.debug=Debug
pico32.menu.DebugLevel.debug.build.code_debug=4
pico32.menu.DebugLevel.verbose=Verbose
pico32.menu.DebugLevel.verbose.build.code_debug=5

pico32.menu.EraseFlash.none=Disabled
pico32.menu.EraseFlash.none.upload.erase_cmd=
pico32.menu.EraseFlash.all=Enabled
pico32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

esp32s3-octal.name=ESP32S3 Dev Module Octal (WROOM2)
esp32s3-octal.vid.0=0x303a
esp32s3-octal.pid.0=0x1001

esp32s3-octal.bootloader.tool=esptool_py
esp32s3-octal.bootloader.tool.default=esptool_py

esp32s3-octal.upload.tool=esptool_py
esp32s3-octal.upload.tool.default=esptool_py
esp32s3-octal.upload.tool.network=esp_ota
esp32s3-octal.upload.maximum_size=1310720
esp32s3-octal.upload.maximum_data_size=327680
esp32s3-octal.upload.flags=
esp32s3-octal.upload.extra_flags=
esp32s3-octal.upload.use_1200bps_touch=false
esp32s3-octal.upload.wait_for_upload_port=false

esp32s3-octal.serial.disableDTR=false
esp32s3-octal.serial.disableRTS=false

esp32s3-octal.build.tarch=xtensa
esp32s3-octal.build.bootloader_addr=0x0
esp32s3-octal.build.target=esp32s3
esp32s3-octal.build.mcu=esp32s3
esp32s3-octal.build.core=esp32
esp32s3-octal.build.variant=esp32s3
esp32s3-octal.build.board=ESP32S3_DEV

esp32s3-octal.build.usb_mode=1
esp32s3-octal.build.cdc_on_boot=0
esp32s3-octal.build.msc_on_boot=0
esp32s3-octal.build.dfu_on_boot=0
esp32s3-octal.build.f_cpu=240000000L
esp32s3-octal.build.flash_size=4MB
esp32s3-octal.build.flash_freq=80m
esp32s3-octal.build.flash_mode=dio

esp32s3-octal.build.boot=opi
esp32s3-octal.build.boot_freq=80m
esp32s3-octal.build.partitions=default
esp32s3-octal.build.defines=
esp32s3-octal.build.loop_core=
esp32s3-octal.build.event_core=
esp32s3-octal.build.psram_type=opi
esp32s3-octal.build.memory_type={build.boot}_{build.psram_type}

esp32s3-octal.menu.JTAGAdapter.default=Disabled
esp32s3-octal.menu.JTAGAdapter.default.build.copy_jtag_files=0
esp32s3-octal.menu.JTAGAdapter.builtin=Integrated USB JTAG
esp32s3-octal.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
esp32s3-octal.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
esp32s3-octal.menu.JTAGAdapter.external=FTDI Adapter
esp32s3-octal.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
esp32s3-octal.menu.JTAGAdapter.external.build.copy_jtag_files=1
esp32s3-octal.menu.JTAGAdapter.bridge=ESP USB Bridge
esp32s3-octal.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
esp32s3-octal.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

esp32s3-octal.menu.PSRAM.opi=OPI PSRAM
esp32s3-octal.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
esp32s3-octal.menu.PSRAM.opi.build.psram_type=opi
esp32s3-octal.menu.PSRAM.enabled=QSPI PSRAM
esp32s3-octal.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
esp32s3-octal.menu.PSRAM.enabled.build.psram_type=qspi
esp32s3-octal.menu.PSRAM.disabled=Disabled
esp32s3-octal.menu.PSRAM.disabled.build.defines=
esp32s3-octal.menu.PSRAM.disabled.build.psram_type=qspi

esp32s3-octal.menu.FlashMode.opi=OPI 80MHz
esp32s3-octal.menu.FlashMode.opi.build.flash_mode=dout
esp32s3-octal.menu.FlashMode.opi.build.boot=opi
esp32s3-octal.menu.FlashMode.opi.build.boot_freq=80m
esp32s3-octal.menu.FlashMode.opi.build.flash_freq=80m
esp32s3-octal.menu.FlashMode.qio=QIO 80MHz
esp32s3-octal.menu.FlashMode.qio.build.flash_mode=dio
esp32s3-octal.menu.FlashMode.qio.build.boot=qio
esp32s3-octal.menu.FlashMode.qio.build.boot_freq=80m
esp32s3-octal.menu.FlashMode.qio.build.flash_freq=80m
esp32s3-octal.menu.FlashMode.qio120=QIO 120MHz
esp32s3-octal.menu.FlashMode.qio120.build.flash_mode=dio
esp32s3-octal.menu.FlashMode.qio120.build.boot=qio
esp32s3-octal.menu.FlashMode.qio120.build.boot_freq=120m
esp32s3-octal.menu.FlashMode.qio120.build.flash_freq=80m
esp32s3-octal.menu.FlashMode.dio=DIO 80MHz
esp32s3-octal.menu.FlashMode.dio.build.flash_mode=dio
esp32s3-octal.menu.FlashMode.dio.build.boot=dio
esp32s3-octal.menu.FlashMode.dio.build.boot_freq=80m
esp32s3-octal.menu.FlashMode.dio.build.flash_freq=80m

esp32s3-octal.menu.FlashSize.16M=16MB (128Mb)
esp32s3-octal.menu.FlashSize.4M=4MB (32Mb)
esp32s3-octal.menu.FlashSize.4M.build.flash_size=4MB
esp32s3-octal.menu.FlashSize.8M=8MB (64Mb)
esp32s3-octal.menu.FlashSize.8M.build.flash_size=8MB
esp32s3-octal.menu.FlashSize.8M.build.partitions=default_8MB
esp32s3-octal.menu.FlashSize.16M=16MB (128Mb)
esp32s3-octal.menu.FlashSize.16M.build.flash_size=16MB
esp32s3-octal.menu.FlashSize.32M=32MB (256Mb)
esp32s3-octal.menu.FlashSize.32M.build.flash_size=32MB
esp32s3-octal.menu.FlashSize.32M.build.partitions=app5M_fat24M_32MB

