espressif/arduino-esp32/boards.txt
esp32s3-octal.menu.DebugLevel.none=None
esp32s3-octal.menu.DebugLevel.none.build.code_debug=0
esp32s3-octal.menu.DebugLevel.error=Error
esp32s3-octal.menu.DebugLevel.error.build.code_debug=1
esp32s3-octal.menu.DebugLevel.warn=Warn
esp32s3-octal.menu.DebugLevel.warn.build.code_debug=2
esp32s3-octal.menu.DebugLevel.info=Info
esp32s3-octal.menu.DebugLevel.info.build.code_debug=3
esp32s3-octal.menu.DebugLevel.debug=Debug
esp32s3-octal.menu.DebugLevel.debug.build.code_debug=4
esp32s3-octal.menu.DebugLevel.verbose=Verbose
esp32s3-octal.menu.DebugLevel.verbose.build.code_debug=5

esp32s3-octal.menu.EraseFlash.none=Disabled
esp32s3-octal.menu.EraseFlash.none.upload.erase_cmd=
esp32s3-octal.menu.EraseFlash.all=Enabled
esp32s3-octal.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

esp32s3box.name=ESP32-S3-Box
esp32s3box.vid.0=0x303a
esp32s3box.pid.0=0x1001

esp32s3box.bootloader.tool=esptool_py
esp32s3box.bootloader.tool.default=esptool_py

esp32s3box.upload.tool=esptool_py
esp32s3box.upload.tool.default=esptool_py
esp32s3box.upload.tool.network=esp_ota

esp32s3box.upload.maximum_size=3145728
esp32s3box.upload.maximum_data_size=327680
esp32s3box.upload.speed=921600
esp32s3box.upload.flags=
esp32s3box.upload.extra_flags=
esp32s3box.upload.use_1200bps_touch=false
esp32s3box.upload.wait_for_upload_port=false

esp32s3box.serial.disableDTR=false
esp32s3box.serial.disableRTS=false

esp32s3box.build.tarch=xtensa
esp32s3box.build.bootloader_addr=0x0
esp32s3box.build.target=esp32s3
esp32s3box.build.mcu=esp32s3
esp32s3box.build.core=esp32
esp32s3box.build.variant=esp32s3box
esp32s3box.build.board=ESP32_S3_BOX

esp32s3box.build.usb_mode=1
esp32s3box.build.cdc_on_boot=1
esp32s3box.build.msc_on_boot=0
esp32s3box.build.dfu_on_boot=0
esp32s3box.build.f_cpu=240000000L
esp32s3box.build.flash_size=16MB
esp32s3box.build.flash_freq=80m
esp32s3box.build.flash_mode=dio
esp32s3box.build.boot=qio
esp32s3box.build.partitions=default
esp32s3box.build.defines=-DBOARD_HAS_PSRAM
esp32s3box.build.memory_type=qio_opi
esp32s3box.build.loop_core=-DARDUINO_RUNNING_CORE=1
esp32s3box.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1

esp32s3box.menu.USBMode.hwcdc=Hardware CDC and JTAG
esp32s3box.menu.USBMode.hwcdc.build.usb_mode=1
esp32s3box.menu.USBMode.hwcdc.upload.use_1200bps_touch=false
esp32s3box.menu.USBMode.hwcdc.upload.wait_for_upload_port=false
esp32s3box.menu.USBMode.default=USB-OTG
esp32s3box.menu.USBMode.default.build.usb_mode=0
esp32s3box.menu.USBMode.default.upload.use_1200bps_touch=true
esp32s3box.menu.USBMode.default.upload.wait_for_upload_port=true

esp32s3box.menu.MSCOnBoot.default=Disabled
esp32s3box.menu.MSCOnBoot.default.build.msc_on_boot=0
esp32s3box.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
esp32s3box.menu.MSCOnBoot.msc.build.msc_on_boot=1

esp32s3box.menu.DFUOnBoot.default=Disabled
esp32s3box.menu.DFUOnBoot.default.build.dfu_on_boot=0
esp32s3box.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
esp32s3box.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

esp32s3box.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
esp32s3box.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
esp32s3box.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
esp32s3box.menu.PartitionScheme.rainmaker=RainMaker
esp32s3box.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
esp32s3box.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728
esp32s3box.menu.PartitionScheme.esp_sr_16=ESP SR 16M (3MB APP/7MB SPIFFS/2.9MB MODEL)
esp32s3box.menu.PartitionScheme.esp_sr_16.upload.maximum_size=3145728
esp32s3box.menu.PartitionScheme.esp_sr_16.upload.extra_flags=0xD10000 {build.path}/srmodels.bin
esp32s3box.menu.PartitionScheme.esp_sr_16.build.partitions=esp_sr_16
esp32s3box.menu.PartitionScheme.custom=Custom
esp32s3box.menu.PartitionScheme.custom.build.partitions=
esp32s3box.menu.PartitionScheme.custom.upload.maximum_size=16777216

esp32s3box.menu.DebugLevel.none=None
esp32s3box.menu.DebugLevel.none.build.code_debug=0
esp32s3box.menu.DebugLevel.error=Error
esp32s3box.menu.DebugLevel.error.build.code_debug=1
esp32s3box.menu.DebugLevel.warn=Warn
esp32s3box.menu.DebugLevel.warn.build.code_debug=2
esp32s3box.menu.DebugLevel.info=Info
esp32s3box.menu.DebugLevel.info.build.code_debug=3
esp32s3box.menu.DebugLevel.debug=Debug
esp32s3box.menu.DebugLevel.debug.build.code_debug=4
esp32s3box.menu.DebugLevel.verbose=Verbose
esp32s3box.menu.DebugLevel.verbose.build.code_debug=5

esp32s3box.menu.EraseFlash.none=Disabled
esp32s3box.menu.EraseFlash.none.upload.erase_cmd=
esp32s3box.menu.EraseFlash.all=Enabled
esp32s3box.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

esp32s3usbotg.name=ESP32-S3-USB-OTG
esp32s3usbotg.vid.0=0x303a
esp32s3usbotg.pid.0=0x1001

esp32s3usbotg.bootloader.tool=esptool_py
esp32s3usbotg.bootloader.tool.default=esptool_py

esp32s3usbotg.upload.tool=esptool_py
esp32s3usbotg.upload.tool.default=esptool_py
esp32s3usbotg.upload.tool.network=esp_ota

esp32s3usbotg.upload.maximum_size=1310720
esp32s3usbotg.upload.maximum_data_size=327680
esp32s3usbotg.upload.speed=921600
esp32s3usbotg.upload.flags=
esp32s3usbotg.upload.extra_flags=
esp32s3usbotg.upload.use_1200bps_touch=false
esp32s3usbotg.upload.wait_for_upload_port=false

esp32s3usbotg.serial.disableDTR=false
esp32s3usbotg.serial.disableRTS=false

esp32s3usbotg.build.tarch=xtensa
esp32s3usbotg.build.bootloader_addr=0x0
esp32s3usbotg.build.target=esp32s3
esp32s3usbotg.build.mcu=esp32s3
esp32s3usbotg.build.core=esp32
esp32s3usbotg.build.variant=esp32s3usbotg
esp32s3usbotg.build.board=ESP32_S3_USB_OTG

esp32s3usbotg.build.usb_mode=0
esp32s3usbotg.build.cdc_on_boot=0
esp32s3usbotg.build.msc_on_boot=0
esp32s3usbotg.build.dfu_on_boot=0
esp32s3usbotg.build.f_cpu=240000000L
esp32s3usbotg.build.flash_size=8MB
esp32s3usbotg.build.flash_freq=80m
esp32s3usbotg.build.flash_mode=dio
esp32s3usbotg.build.boot=qio
esp32s3usbotg.build.partitions=default
esp32s3usbotg.build.defines=
esp32s3usbotg.build.memory_type=qio_qspi
esp32s3usbotg.build.loop_core=-DARDUINO_RUNNING_CORE=1
esp32s3usbotg.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1

