espressif/arduino-esp32/boards.txt
##############################################################

um_feathers2.name=UM FeatherS2
um_feathers2.vid.0=0x239A
um_feathers2.pid.0=0x80AB

um_feathers2.bootloader.tool=esptool_py
um_feathers2.bootloader.tool.default=esptool_py

um_feathers2.upload.tool=esptool_py
um_feathers2.upload.tool.default=esptool_py
um_feathers2.upload.tool.network=esp_ota

um_feathers2.upload.maximum_size=1310720
um_feathers2.upload.maximum_data_size=327680
um_feathers2.upload.flags=
um_feathers2.upload.extra_flags=
um_feathers2.upload.use_1200bps_touch=true
um_feathers2.upload.wait_for_upload_port=true

um_feathers2.serial.disableDTR=false
um_feathers2.serial.disableRTS=false

um_feathers2.build.tarch=xtensa
um_feathers2.build.bootloader_addr=0x1000
um_feathers2.build.target=esp32s2
um_feathers2.build.mcu=esp32s2
um_feathers2.build.core=esp32
um_feathers2.build.variant=um_feathers2
um_feathers2.build.board=FEATHERS2

um_feathers2.build.cdc_on_boot=1
um_feathers2.build.msc_on_boot=0
um_feathers2.build.dfu_on_boot=0
um_feathers2.build.f_cpu=240000000L
um_feathers2.build.flash_size=16MB
um_feathers2.build.flash_freq=80m
um_feathers2.build.flash_mode=dio
um_feathers2.build.boot=qio
um_feathers2.build.partitions=fatflash
um_feathers2.build.defines=

um_feathers2.menu.CDCOnBoot.cdc=Enabled
um_feathers2.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
um_feathers2.menu.CDCOnBoot.default=Disabled
um_feathers2.menu.CDCOnBoot.default.build.cdc_on_boot=0

um_feathers2.menu.MSCOnBoot.default=Disabled
um_feathers2.menu.MSCOnBoot.default.build.msc_on_boot=0
um_feathers2.menu.MSCOnBoot.msc=Enabled
um_feathers2.menu.MSCOnBoot.msc.build.msc_on_boot=1

um_feathers2.menu.DFUOnBoot.default=Disabled
um_feathers2.menu.DFUOnBoot.default.build.dfu_on_boot=0
um_feathers2.menu.DFUOnBoot.dfu=Enabled
um_feathers2.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

um_feathers2.menu.PSRAM.enabled=Enabled
um_feathers2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
um_feathers2.menu.PSRAM.disabled=Disabled
um_feathers2.menu.PSRAM.disabled.build.defines=

um_feathers2.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
um_feathers2.menu.PartitionScheme.fatflash.build.partitions=ffat
um_feathers2.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
um_feathers2.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
um_feathers2.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
um_feathers2.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
um_feathers2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
um_feathers2.menu.PartitionScheme.default.build.partitions=default
um_feathers2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
um_feathers2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
um_feathers2.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
um_feathers2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
um_feathers2.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
um_feathers2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
um_feathers2.menu.PartitionScheme.minimal.build.partitions=minimal
um_feathers2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
um_feathers2.menu.PartitionScheme.no_ota.build.partitions=no_ota
um_feathers2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
um_feathers2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
um_feathers2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
um_feathers2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
um_feathers2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
um_feathers2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
um_feathers2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
um_feathers2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
um_feathers2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
um_feathers2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
um_feathers2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
um_feathers2.menu.PartitionScheme.huge_app.build.partitions=huge_app
um_feathers2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
um_feathers2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
um_feathers2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
um_feathers2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

um_feathers2.menu.CPUFreq.240=240MHz (WiFi)
um_feathers2.menu.CPUFreq.240.build.f_cpu=240000000L
um_feathers2.menu.CPUFreq.160=160MHz (WiFi)
um_feathers2.menu.CPUFreq.160.build.f_cpu=160000000L
um_feathers2.menu.CPUFreq.80=80MHz (WiFi)
um_feathers2.menu.CPUFreq.80.build.f_cpu=80000000L
um_feathers2.menu.CPUFreq.40=40MHz
um_feathers2.menu.CPUFreq.40.build.f_cpu=40000000L
um_feathers2.menu.CPUFreq.20=20MHz
um_feathers2.menu.CPUFreq.20.build.f_cpu=20000000L
um_feathers2.menu.CPUFreq.10=10MHz
um_feathers2.menu.CPUFreq.10.build.f_cpu=10000000L

um_feathers2.menu.FlashSize.16M=16MB (128Mb)
um_feathers2.menu.FlashSize.16M.build.flash_size=16MB
um_feathers2.menu.FlashSize.4M=4MB (32Mb)
um_feathers2.menu.FlashSize.4M.build.flash_size=4MB
um_feathers2.menu.FlashSize.8M=8MB (64Mb)
um_feathers2.menu.FlashSize.8M.build.flash_size=8MB
um_feathers2.menu.FlashSize.8M.build.partitions=default_8MB
um_feathers2.menu.FlashSize.2M=2MB (16Mb)
um_feathers2.menu.FlashSize.2M.build.flash_size=2MB
um_feathers2.menu.FlashSize.2M.build.partitions=minimal

um_feathers2.menu.UploadSpeed.921600=921600
um_feathers2.menu.UploadSpeed.921600.upload.speed=921600
um_feathers2.menu.UploadSpeed.115200=115200
um_feathers2.menu.UploadSpeed.115200.upload.speed=115200
um_feathers2.menu.UploadSpeed.256000.windows=256000
um_feathers2.menu.UploadSpeed.256000.upload.speed=256000
um_feathers2.menu.UploadSpeed.230400.windows.upload.speed=256000
um_feathers2.menu.UploadSpeed.230400=230400
um_feathers2.menu.UploadSpeed.230400.upload.speed=230400
um_feathers2.menu.UploadSpeed.460800.linux=460800
um_feathers2.menu.UploadSpeed.460800.macosx=460800
um_feathers2.menu.UploadSpeed.460800.upload.speed=460800

um_feathers2.menu.DebugLevel.none=None
um_feathers2.menu.DebugLevel.none.build.code_debug=0
um_feathers2.menu.DebugLevel.error=Error
um_feathers2.menu.DebugLevel.error.build.code_debug=1
um_feathers2.menu.DebugLevel.warn=Warn
um_feathers2.menu.DebugLevel.warn.build.code_debug=2
um_feathers2.menu.DebugLevel.info=Info
um_feathers2.menu.DebugLevel.info.build.code_debug=3
um_feathers2.menu.DebugLevel.debug=Debug
um_feathers2.menu.DebugLevel.debug.build.code_debug=4
um_feathers2.menu.DebugLevel.verbose=Verbose
um_feathers2.menu.DebugLevel.verbose.build.code_debug=5

um_feathers2.menu.EraseFlash.none=Disabled
um_feathers2.menu.EraseFlash.none.upload.erase_cmd=
um_feathers2.menu.EraseFlash.all=Enabled
um_feathers2.menu.EraseFlash.all.upload.erase_cmd=-e

