espressif/arduino-esp32/boards.txt
um_tinyc6.menu.EraseFlash.none=Disabled
um_tinyc6.menu.EraseFlash.none.upload.erase_cmd=
um_tinyc6.menu.EraseFlash.all=Enabled
um_tinyc6.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

um_tinys2.name=UM TinyS2
um_tinys2.vid.0=0x303a
um_tinys2.pid.0=0x8001

um_tinys2.bootloader.tool=esptool_py
um_tinys2.bootloader.tool.default=esptool_py

um_tinys2.upload.tool=esptool_py
um_tinys2.upload.tool.default=esptool_py
um_tinys2.upload.tool.network=esp_ota

um_tinys2.upload.maximum_size=1310720
um_tinys2.upload.maximum_data_size=327680
um_tinys2.upload.flags=
um_tinys2.upload.extra_flags=
um_tinys2.upload.use_1200bps_touch=true
um_tinys2.upload.wait_for_upload_port=true

um_tinys2.serial.disableDTR=false
um_tinys2.serial.disableRTS=false

um_tinys2.build.tarch=xtensa
um_tinys2.build.bootloader_addr=0x1000
um_tinys2.build.target=esp32s2
um_tinys2.build.mcu=esp32s2
um_tinys2.build.core=esp32
um_tinys2.build.variant=um_tinys2
um_tinys2.build.board=TINYS2

um_tinys2.build.cdc_on_boot=1
um_tinys2.build.msc_on_boot=0
um_tinys2.build.dfu_on_boot=0
um_tinys2.build.f_cpu=240000000L
um_tinys2.build.flash_size=4MB
um_tinys2.build.flash_freq=80m
um_tinys2.build.flash_mode=dio
um_tinys2.build.boot=qio
um_tinys2.build.partitions=default
um_tinys2.build.defines=

um_tinys2.menu.CDCOnBoot.cdc=Enabled
um_tinys2.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
um_tinys2.menu.CDCOnBoot.default=Disabled
um_tinys2.menu.CDCOnBoot.default.build.cdc_on_boot=0

um_tinys2.menu.MSCOnBoot.default=Disabled
um_tinys2.menu.MSCOnBoot.default.build.msc_on_boot=0
um_tinys2.menu.MSCOnBoot.msc=Enabled
um_tinys2.menu.MSCOnBoot.msc.build.msc_on_boot=1

um_tinys2.menu.DFUOnBoot.default=Disabled
um_tinys2.menu.DFUOnBoot.default.build.dfu_on_boot=0
um_tinys2.menu.DFUOnBoot.dfu=Enabled
um_tinys2.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

um_tinys2.menu.PSRAM.enabled=Enabled
um_tinys2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
um_tinys2.menu.PSRAM.disabled=Disabled
um_tinys2.menu.PSRAM.disabled.build.defines=

um_tinys2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
um_tinys2.menu.PartitionScheme.default.build.partitions=default
um_tinys2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
um_tinys2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
um_tinys2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
um_tinys2.menu.PartitionScheme.minimal.build.partitions=minimal
um_tinys2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
um_tinys2.menu.PartitionScheme.no_ota.build.partitions=no_ota
um_tinys2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
um_tinys2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
um_tinys2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
um_tinys2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
um_tinys2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
um_tinys2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
um_tinys2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
um_tinys2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
um_tinys2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
um_tinys2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
um_tinys2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
um_tinys2.menu.PartitionScheme.huge_app.build.partitions=huge_app
um_tinys2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
um_tinys2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
um_tinys2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
um_tinys2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

um_tinys2.menu.CPUFreq.240=240MHz (WiFi)
um_tinys2.menu.CPUFreq.240.build.f_cpu=240000000L
um_tinys2.menu.CPUFreq.160=160MHz (WiFi)
um_tinys2.menu.CPUFreq.160.build.f_cpu=160000000L
um_tinys2.menu.CPUFreq.80=80MHz (WiFi)
um_tinys2.menu.CPUFreq.80.build.f_cpu=80000000L
um_tinys2.menu.CPUFreq.40=40MHz
um_tinys2.menu.CPUFreq.40.build.f_cpu=40000000L
um_tinys2.menu.CPUFreq.20=20MHz
um_tinys2.menu.CPUFreq.20.build.f_cpu=20000000L
um_tinys2.menu.CPUFreq.10=10MHz
um_tinys2.menu.CPUFreq.10.build.f_cpu=10000000L

um_tinys2.menu.FlashSize.4M=4MB (32Mb)
um_tinys2.menu.FlashSize.4M.build.flash_size=4MB
um_tinys2.menu.FlashSize.2M=2MB (16Mb)
um_tinys2.menu.FlashSize.2M.build.flash_size=2MB
um_tinys2.menu.FlashSize.2M.build.partitions=minimal

um_tinys2.menu.UploadSpeed.921600=921600
um_tinys2.menu.UploadSpeed.921600.upload.speed=921600
um_tinys2.menu.UploadSpeed.115200=115200
um_tinys2.menu.UploadSpeed.115200.upload.speed=115200
um_tinys2.menu.UploadSpeed.256000.windows=256000
um_tinys2.menu.UploadSpeed.256000.upload.speed=256000
um_tinys2.menu.UploadSpeed.230400.windows.upload.speed=256000
um_tinys2.menu.UploadSpeed.230400=230400
um_tinys2.menu.UploadSpeed.230400.upload.speed=230400
um_tinys2.menu.UploadSpeed.460800.linux=460800
um_tinys2.menu.UploadSpeed.460800.macosx=460800
um_tinys2.menu.UploadSpeed.460800.upload.speed=460800

um_tinys2.menu.DebugLevel.none=None
um_tinys2.menu.DebugLevel.none.build.code_debug=0
um_tinys2.menu.DebugLevel.error=Error
um_tinys2.menu.DebugLevel.error.build.code_debug=1
um_tinys2.menu.DebugLevel.warn=Warn
um_tinys2.menu.DebugLevel.warn.build.code_debug=2
um_tinys2.menu.DebugLevel.info=Info
um_tinys2.menu.DebugLevel.info.build.code_debug=3
um_tinys2.menu.DebugLevel.debug=Debug
um_tinys2.menu.DebugLevel.debug.build.code_debug=4
um_tinys2.menu.DebugLevel.verbose=Verbose
um_tinys2.menu.DebugLevel.verbose.build.code_debug=5

um_tinys2.menu.EraseFlash.none=Disabled
um_tinys2.menu.EraseFlash.none.upload.erase_cmd=
um_tinys2.menu.EraseFlash.all=Enabled
um_tinys2.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

um_tinys3.name=UM TinyS3
um_tinys3.vid.0=0x303a
um_tinys3.pid.0=0x80D0

um_tinys3.bootloader.tool=esptool_py
um_tinys3.bootloader.tool.default=esptool_py

um_tinys3.upload.tool=esptool_py
um_tinys3.upload.tool.default=esptool_py
um_tinys3.upload.tool.network=esp_ota

um_tinys3.upload.maximum_size=1310720
um_tinys3.upload.maximum_data_size=327680
um_tinys3.upload.flags=
um_tinys3.upload.extra_flags=
um_tinys3.upload.use_1200bps_touch=false
um_tinys3.upload.wait_for_upload_port=false

um_tinys3.serial.disableDTR=false
um_tinys3.serial.disableRTS=false

um_tinys3.build.tarch=xtensa
um_tinys3.build.bootloader_addr=0x0
um_tinys3.build.target=esp32s3
um_tinys3.build.mcu=esp32s3
um_tinys3.build.core=esp32
um_tinys3.build.variant=um_tinys3
um_tinys3.build.board=TINYS3

um_tinys3.build.usb_mode=1
um_tinys3.build.cdc_on_boot=0
um_tinys3.build.msc_on_boot=0
um_tinys3.build.dfu_on_boot=0
um_tinys3.build.f_cpu=240000000L
um_tinys3.build.flash_size=8MB
um_tinys3.build.flash_freq=80m
um_tinys3.build.flash_mode=dio
um_tinys3.build.boot=qio
um_tinys3.build.partitions=default
um_tinys3.build.defines=
um_tinys3.build.loop_core=
um_tinys3.build.event_core=
um_tinys3.build.flash_type=qio
um_tinys3.build.psram_type=qspi
um_tinys3.build.memory_type=qio_qspi

um_tinys3.menu.LoopCore.1=Core 1
um_tinys3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
um_tinys3.menu.LoopCore.0=Core 0
um_tinys3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

um_tinys3.menu.EventsCore.1=Core 1
um_tinys3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
um_tinys3.menu.EventsCore.0=Core 0
um_tinys3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

