espressif/arduino-esp32/boards.txt
um_tinys3.menu.USBMode.default=USB-OTG (TinyUSB)
um_tinys3.menu.USBMode.default.build.usb_mode=0
um_tinys3.menu.USBMode.hwcdc=Hardware CDC and JTAG
um_tinys3.menu.USBMode.hwcdc.build.usb_mode=1

um_tinys3.menu.CDCOnBoot.cdc=Enabled
um_tinys3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
um_tinys3.menu.CDCOnBoot.default=Disabled
um_tinys3.menu.CDCOnBoot.default.build.cdc_on_boot=0

um_tinys3.menu.MSCOnBoot.default=Disabled
um_tinys3.menu.MSCOnBoot.default.build.msc_on_boot=0
um_tinys3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
um_tinys3.menu.MSCOnBoot.msc.build.msc_on_boot=1

um_tinys3.menu.DFUOnBoot.default=Disabled
um_tinys3.menu.DFUOnBoot.default.build.dfu_on_boot=0
um_tinys3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
um_tinys3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

um_tinys3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
um_tinys3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
um_tinys3.menu.UploadMode.cdc.upload.wait_for_upload_port=true
um_tinys3.menu.UploadMode.default=UART0 / Hardware CDC
um_tinys3.menu.UploadMode.default.upload.use_1200bps_touch=false
um_tinys3.menu.UploadMode.default.upload.wait_for_upload_port=false

um_tinys3.menu.PSRAM.enabled=Enabled
um_tinys3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
um_tinys3.menu.PSRAM.disabled=Disabled
um_tinys3.menu.PSRAM.disabled.build.defines=

um_tinys3.menu.PartitionScheme.default_8MB=Default (3MB APP/1.5MB SPIFFS)
um_tinys3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
um_tinys3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
um_tinys3.menu.PartitionScheme.tinyuf2=TinyUF2 Compatibility (2MB APP/3.7MB FFAT)
um_tinys3.menu.PartitionScheme.tinyuf2.build.custom_bootloader=bootloader_tinyuf2
um_tinys3.menu.PartitionScheme.tinyuf2.build.custom_partitions=partitions_tinyuf2
um_tinys3.menu.PartitionScheme.tinyuf2.upload.extra_flags=0x410000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
um_tinys3.menu.PartitionScheme.tinyuf2.upload.maximum_size=2097152

um_tinys3.menu.CPUFreq.240=240MHz (WiFi)
um_tinys3.menu.CPUFreq.240.build.f_cpu=240000000L
um_tinys3.menu.CPUFreq.160=160MHz (WiFi)
um_tinys3.menu.CPUFreq.160.build.f_cpu=160000000L
um_tinys3.menu.CPUFreq.80=80MHz (WiFi)
um_tinys3.menu.CPUFreq.80.build.f_cpu=80000000L
um_tinys3.menu.CPUFreq.40=40MHz
um_tinys3.menu.CPUFreq.40.build.f_cpu=40000000L
um_tinys3.menu.CPUFreq.20=20MHz
um_tinys3.menu.CPUFreq.20.build.f_cpu=20000000L
um_tinys3.menu.CPUFreq.10=10MHz
um_tinys3.menu.CPUFreq.10.build.f_cpu=10000000L

um_tinys3.menu.FlashMode.qio=QIO
um_tinys3.menu.FlashMode.qio.build.flash_mode=dio
um_tinys3.menu.FlashMode.qio.build.boot=qio
um_tinys3.menu.FlashMode.dio=DIO
um_tinys3.menu.FlashMode.dio.build.flash_mode=dio
um_tinys3.menu.FlashMode.dio.build.boot=dio

um_tinys3.menu.UploadSpeed.921600=921600
um_tinys3.menu.UploadSpeed.921600.upload.speed=921600
um_tinys3.menu.UploadSpeed.115200=115200
um_tinys3.menu.UploadSpeed.115200.upload.speed=115200
um_tinys3.menu.UploadSpeed.256000.windows=256000
um_tinys3.menu.UploadSpeed.256000.upload.speed=256000
um_tinys3.menu.UploadSpeed.230400.windows.upload.speed=256000
um_tinys3.menu.UploadSpeed.230400=230400
um_tinys3.menu.UploadSpeed.230400.upload.speed=230400
um_tinys3.menu.UploadSpeed.460800.linux=460800
um_tinys3.menu.UploadSpeed.460800.macosx=460800
um_tinys3.menu.UploadSpeed.460800.upload.speed=460800
um_tinys3.menu.UploadSpeed.512000.windows=512000
um_tinys3.menu.UploadSpeed.512000.upload.speed=512000

um_tinys3.menu.DebugLevel.none=None
um_tinys3.menu.DebugLevel.none.build.code_debug=0
um_tinys3.menu.DebugLevel.error=Error
um_tinys3.menu.DebugLevel.error.build.code_debug=1
um_tinys3.menu.DebugLevel.warn=Warn
um_tinys3.menu.DebugLevel.warn.build.code_debug=2
um_tinys3.menu.DebugLevel.info=Info
um_tinys3.menu.DebugLevel.info.build.code_debug=3
um_tinys3.menu.DebugLevel.debug=Debug
um_tinys3.menu.DebugLevel.debug.build.code_debug=4
um_tinys3.menu.DebugLevel.verbose=Verbose
um_tinys3.menu.DebugLevel.verbose.build.code_debug=5

um_tinys3.menu.EraseFlash.none=Disabled
um_tinys3.menu.EraseFlash.none.upload.erase_cmd=
um_tinys3.menu.EraseFlash.all=Enabled
um_tinys3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

S_ODI_Ultra.name=S.ODI Ultra v1

S_ODI_Ultra.bootloader.tool=esptool_py
S_ODI_Ultra.bootloader.tool.default=esptool_py

S_ODI_Ultra.upload.tool=esptool_py
S_ODI_Ultra.upload.tool.default=esptool_py
S_ODI_Ultra.upload.tool.network=esp_ota

S_ODI_Ultra.upload.maximum_size=1310720
S_ODI_Ultra.upload.maximum_data_size=327680
S_ODI_Ultra.upload.wait_for_upload_port=true
S_ODI_Ultra.upload.flags=
S_ODI_Ultra.upload.extra_flags=

S_ODI_Ultra.serial.disableDTR=true
S_ODI_Ultra.serial.disableRTS=true

S_ODI_Ultra.build.tarch=xtensa
S_ODI_Ultra.build.bootloader_addr=0x1000
S_ODI_Ultra.build.target=esp32
S_ODI_Ultra.build.mcu=esp32
S_ODI_Ultra.build.core=esp32
S_ODI_Ultra.build.variant=S_ODI_Ultra_v1
S_ODI_Ultra.build.board=ESP32_DEV

S_ODI_Ultra.build.f_cpu=240000000L
S_ODI_Ultra.build.flash_mode=dio
S_ODI_Ultra.build.flash_size=4MB
S_ODI_Ultra.build.boot=dio
S_ODI_Ultra.build.partitions=default
S_ODI_Ultra.build.defines=

S_ODI_Ultra.menu.FlashFreq.80=80MHz
S_ODI_Ultra.menu.FlashFreq.80.build.flash_freq=80m
S_ODI_Ultra.menu.FlashFreq.40=40MHz
S_ODI_Ultra.menu.FlashFreq.40.build.flash_freq=40m

S_ODI_Ultra.menu.UploadSpeed.921600=921600
S_ODI_Ultra.menu.UploadSpeed.921600.upload.speed=921600
S_ODI_Ultra.menu.UploadSpeed.115200=115200
S_ODI_Ultra.menu.UploadSpeed.115200.upload.speed=115200
S_ODI_Ultra.menu.UploadSpeed.256000.windows=256000
S_ODI_Ultra.menu.UploadSpeed.256000.upload.speed=256000
S_ODI_Ultra.menu.UploadSpeed.230400.windows.upload.speed=256000
S_ODI_Ultra.menu.UploadSpeed.230400=230400
S_ODI_Ultra.menu.UploadSpeed.230400.upload.speed=230400
S_ODI_Ultra.menu.UploadSpeed.460800.linux=460800
S_ODI_Ultra.menu.UploadSpeed.460800.macosx=460800
S_ODI_Ultra.menu.UploadSpeed.460800.upload.speed=460800
S_ODI_Ultra.menu.UploadSpeed.512000.windows=512000
S_ODI_Ultra.menu.UploadSpeed.512000.upload.speed=512000

S_ODI_Ultra.menu.DebugLevel.none=None
S_ODI_Ultra.menu.DebugLevel.none.build.code_debug=0
S_ODI_Ultra.menu.DebugLevel.error=Error
S_ODI_Ultra.menu.DebugLevel.error.build.code_debug=1
S_ODI_Ultra.menu.DebugLevel.warn=Warn
S_ODI_Ultra.menu.DebugLevel.warn.build.code_debug=2
S_ODI_Ultra.menu.DebugLevel.info=Info
S_ODI_Ultra.menu.DebugLevel.info.build.code_debug=3
S_ODI_Ultra.menu.DebugLevel.debug=Debug
S_ODI_Ultra.menu.DebugLevel.debug.build.code_debug=4

S_ODI_Ultra.menu.EraseFlash.none=Disabled
S_ODI_Ultra.menu.EraseFlash.none.upload.erase_cmd=
S_ODI_Ultra.menu.EraseFlash.all=Enabled
S_ODI_Ultra.menu.EraseFlash.all.upload.erase_cmd=-e

