espressif/arduino-esp32/boards.txt
adafruit_metro_esp32s2.menu.FlashMode.qio=QIO
adafruit_metro_esp32s2.menu.FlashMode.qio.build.flash_mode=dio
adafruit_metro_esp32s2.menu.FlashMode.qio.build.boot=qio
adafruit_metro_esp32s2.menu.FlashMode.dio=DIO
adafruit_metro_esp32s2.menu.FlashMode.dio.build.flash_mode=dio
adafruit_metro_esp32s2.menu.FlashMode.dio.build.boot=dio

adafruit_metro_esp32s2.menu.FlashFreq.80=80MHz
adafruit_metro_esp32s2.menu.FlashFreq.80.build.flash_freq=80m
adafruit_metro_esp32s2.menu.FlashFreq.40=40MHz
adafruit_metro_esp32s2.menu.FlashFreq.40.build.flash_freq=40m

adafruit_metro_esp32s2.menu.FlashSize.4M=4MB (32Mb)
adafruit_metro_esp32s2.menu.FlashSize.4M.build.flash_size=4MB

adafruit_metro_esp32s2.menu.UploadSpeed.921600=921600
adafruit_metro_esp32s2.menu.UploadSpeed.921600.upload.speed=921600
adafruit_metro_esp32s2.menu.UploadSpeed.115200=115200
adafruit_metro_esp32s2.menu.UploadSpeed.115200.upload.speed=115200
adafruit_metro_esp32s2.menu.UploadSpeed.256000.windows=256000
adafruit_metro_esp32s2.menu.UploadSpeed.256000.upload.speed=256000
adafruit_metro_esp32s2.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_metro_esp32s2.menu.UploadSpeed.230400=230400
adafruit_metro_esp32s2.menu.UploadSpeed.230400.upload.speed=230400
adafruit_metro_esp32s2.menu.UploadSpeed.460800.linux=460800
adafruit_metro_esp32s2.menu.UploadSpeed.460800.macosx=460800
adafruit_metro_esp32s2.menu.UploadSpeed.460800.upload.speed=460800
adafruit_metro_esp32s2.menu.UploadSpeed.512000.windows=512000
adafruit_metro_esp32s2.menu.UploadSpeed.512000.upload.speed=512000

adafruit_metro_esp32s2.menu.DebugLevel.none=None
adafruit_metro_esp32s2.menu.DebugLevel.none.build.code_debug=0
adafruit_metro_esp32s2.menu.DebugLevel.error=Error
adafruit_metro_esp32s2.menu.DebugLevel.error.build.code_debug=1
adafruit_metro_esp32s2.menu.DebugLevel.warn=Warn
adafruit_metro_esp32s2.menu.DebugLevel.warn.build.code_debug=2
adafruit_metro_esp32s2.menu.DebugLevel.info=Info
adafruit_metro_esp32s2.menu.DebugLevel.info.build.code_debug=3
adafruit_metro_esp32s2.menu.DebugLevel.debug=Debug
adafruit_metro_esp32s2.menu.DebugLevel.debug.build.code_debug=4
adafruit_metro_esp32s2.menu.DebugLevel.verbose=Verbose
adafruit_metro_esp32s2.menu.DebugLevel.verbose.build.code_debug=5

adafruit_metro_esp32s2.menu.EraseFlash.none=Disabled
adafruit_metro_esp32s2.menu.EraseFlash.none.upload.erase_cmd=
adafruit_metro_esp32s2.menu.EraseFlash.all=Enabled
adafruit_metro_esp32s2.menu.EraseFlash.all.upload.erase_cmd=-e

adafruit_metro_esp32s2.menu.ZigbeeMode.default=Disabled
adafruit_metro_esp32s2.menu.ZigbeeMode.default.build.zigbee_mode=
adafruit_metro_esp32s2.menu.ZigbeeMode.default.build.zigbee_libs=
adafruit_metro_esp32s2.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator)
adafruit_metro_esp32s2.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
adafruit_metro_esp32s2.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api_zczr -lesp_zb_cli_command -lzboss_stack.zczr.trace -lzboss_stack.zczr -lzboss_port

##############################################################
# Adafruit Metro ESP32-S3

adafruit_metro_esp32s3.name=Adafruit Metro ESP32-S3
adafruit_metro_esp32s3.vid.0=0x239A
adafruit_metro_esp32s3.pid.0=0x8145
adafruit_metro_esp32s3.vid.1=0x239A
adafruit_metro_esp32s3.pid.1=0x0145
adafruit_metro_esp32s3.vid.2=0x239A
adafruit_metro_esp32s3.pid.2=0x8146

adafruit_metro_esp32s3.bootloader.tool=esptool_py
adafruit_metro_esp32s3.bootloader.tool.default=esptool_py

adafruit_metro_esp32s3.upload.tool=esptool_py
adafruit_metro_esp32s3.upload.tool.default=esptool_py
adafruit_metro_esp32s3.upload.tool.network=esp_ota

adafruit_metro_esp32s3.upload.maximum_size=1310720
adafruit_metro_esp32s3.upload.maximum_data_size=327680
adafruit_metro_esp32s3.upload.flags=
adafruit_metro_esp32s3.upload.extra_flags=
adafruit_metro_esp32s3.upload.use_1200bps_touch=true
adafruit_metro_esp32s3.upload.wait_for_upload_port=true

adafruit_metro_esp32s3.serial.disableDTR=false
adafruit_metro_esp32s3.serial.disableRTS=false

adafruit_metro_esp32s3.build.tarch=xtensa
adafruit_metro_esp32s3.build.bootloader_addr=0x0
adafruit_metro_esp32s3.build.target=esp32s3
adafruit_metro_esp32s3.build.mcu=esp32s3
adafruit_metro_esp32s3.build.core=esp32
adafruit_metro_esp32s3.build.variant=adafruit_metro_esp32s3
adafruit_metro_esp32s3.build.board=METRO_ESP32S3

adafruit_metro_esp32s3.build.usb_mode=0
adafruit_metro_esp32s3.build.cdc_on_boot=1
adafruit_metro_esp32s3.build.msc_on_boot=0
adafruit_metro_esp32s3.build.dfu_on_boot=0
adafruit_metro_esp32s3.build.f_cpu=240000000L
adafruit_metro_esp32s3.build.flash_size=16MB
adafruit_metro_esp32s3.build.flash_freq=80m
adafruit_metro_esp32s3.build.flash_mode=dio
adafruit_metro_esp32s3.build.boot=qio
adafruit_metro_esp32s3.build.partitions=default
adafruit_metro_esp32s3.build.defines=
adafruit_metro_esp32s3.build.loop_core=
adafruit_metro_esp32s3.build.event_core=
adafruit_metro_esp32s3.build.flash_type=qio
adafruit_metro_esp32s3.build.psram_type=opi
adafruit_metro_esp32s3.build.memory_type={build.flash_type}_{build.psram_type}

adafruit_metro_esp32s3.menu.LoopCore.1=Core 1
adafruit_metro_esp32s3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
adafruit_metro_esp32s3.menu.LoopCore.0=Core 0
adafruit_metro_esp32s3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

adafruit_metro_esp32s3.menu.EventsCore.1=Core 1
adafruit_metro_esp32s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
adafruit_metro_esp32s3.menu.EventsCore.0=Core 0
adafruit_metro_esp32s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

adafruit_metro_esp32s3.menu.USBMode.default=USB-OTG (TinyUSB)
adafruit_metro_esp32s3.menu.USBMode.default.build.usb_mode=0
adafruit_metro_esp32s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
adafruit_metro_esp32s3.menu.USBMode.hwcdc.build.usb_mode=1

adafruit_metro_esp32s3.menu.CDCOnBoot.cdc=Enabled
adafruit_metro_esp32s3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
adafruit_metro_esp32s3.menu.CDCOnBoot.default=Disabled
adafruit_metro_esp32s3.menu.CDCOnBoot.default.build.cdc_on_boot=0

