espressif/arduino-esp32/boards.txt
adafruit_metro_esp32s3.menu.MSCOnBoot.default=Disabled
adafruit_metro_esp32s3.menu.MSCOnBoot.default.build.msc_on_boot=0
adafruit_metro_esp32s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
adafruit_metro_esp32s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

adafruit_metro_esp32s3.menu.DFUOnBoot.default=Disabled
adafruit_metro_esp32s3.menu.DFUOnBoot.default.build.dfu_on_boot=0
adafruit_metro_esp32s3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
adafruit_metro_esp32s3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

adafruit_metro_esp32s3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
adafruit_metro_esp32s3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
adafruit_metro_esp32s3.menu.UploadMode.cdc.upload.wait_for_upload_port=true
adafruit_metro_esp32s3.menu.UploadMode.default=UART0 / Hardware CDC
adafruit_metro_esp32s3.menu.UploadMode.default.upload.use_1200bps_touch=false
adafruit_metro_esp32s3.menu.UploadMode.default.upload.wait_for_upload_port=false

adafruit_metro_esp32s3.menu.PSRAM.opi=OPI PSRAM
adafruit_metro_esp32s3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
adafruit_metro_esp32s3.menu.PSRAM.opi.build.psram_type=opi
adafruit_metro_esp32s3.menu.PSRAM.disabled=Disabled
adafruit_metro_esp32s3.menu.PSRAM.disabled.build.defines=
adafruit_metro_esp32s3.menu.PSRAM.disabled.build.psram_type=opi

adafruit_metro_esp32s3.menu.PartitionScheme.tinyuf2=TinyUF2 16MB (2MB APP/11.6MB FATFS)
adafruit_metro_esp32s3.menu.PartitionScheme.tinyuf2.build.custom_bootloader=bootloader-tinyuf2
adafruit_metro_esp32s3.menu.PartitionScheme.tinyuf2.build.partitions=tinyuf2-partitions-16MB
adafruit_metro_esp32s3.menu.PartitionScheme.tinyuf2.upload.maximum_size=2097152
adafruit_metro_esp32s3.menu.PartitionScheme.tinyuf2.upload.extra_flags=0x410000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
adafruit_metro_esp32s3.menu.PartitionScheme.tinyuf2_noota=TinyUF2 16MB No OTA(4MB APP/11.6MB FATFS)
adafruit_metro_esp32s3.menu.PartitionScheme.tinyuf2_noota.build.custom_bootloader=bootloader-tinyuf2
adafruit_metro_esp32s3.menu.PartitionScheme.tinyuf2_noota.build.partitions=tinyuf2-partitions-16MB-noota
adafruit_metro_esp32s3.menu.PartitionScheme.tinyuf2_noota.upload.maximum_size=4194304
adafruit_metro_esp32s3.menu.PartitionScheme.tinyuf2_noota.upload.extra_flags=0x410000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
adafruit_metro_esp32s3.menu.PartitionScheme.default_16MB=Default (6.25MB APP/3.43MB SPIFFS)
adafruit_metro_esp32s3.menu.PartitionScheme.default_16MB.build.partitions=default_16MB
adafruit_metro_esp32s3.menu.PartitionScheme.default_16MB.upload.maximum_size=6553600
adafruit_metro_esp32s3.menu.PartitionScheme.large_spiffs=Large SPIFFS (4.5MB APP/6.93MB SPIFFS)
adafruit_metro_esp32s3.menu.PartitionScheme.large_spiffs.build.partitions=large_spiffs_16MB
adafruit_metro_esp32s3.menu.PartitionScheme.large_spiffs.upload.maximum_size=4718592
adafruit_metro_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
adafruit_metro_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
adafruit_metro_esp32s3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
adafruit_metro_esp32s3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
adafruit_metro_esp32s3.menu.PartitionScheme.fatflash.build.partitions=ffat
adafruit_metro_esp32s3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152

adafruit_metro_esp32s3.menu.CPUFreq.240=240MHz (WiFi)
adafruit_metro_esp32s3.menu.CPUFreq.240.build.f_cpu=240000000L
adafruit_metro_esp32s3.menu.CPUFreq.160=160MHz (WiFi)
adafruit_metro_esp32s3.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_metro_esp32s3.menu.CPUFreq.80=80MHz (WiFi)
adafruit_metro_esp32s3.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_metro_esp32s3.menu.CPUFreq.40=40MHz
adafruit_metro_esp32s3.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_metro_esp32s3.menu.CPUFreq.20=20MHz
adafruit_metro_esp32s3.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_metro_esp32s3.menu.CPUFreq.10=10MHz
adafruit_metro_esp32s3.menu.CPUFreq.10.build.f_cpu=10000000L

adafruit_metro_esp32s3.menu.FlashMode.qio=QIO 80MHz
adafruit_metro_esp32s3.menu.FlashMode.qio.build.flash_mode=dio
adafruit_metro_esp32s3.menu.FlashMode.qio.build.boot=qio
adafruit_metro_esp32s3.menu.FlashMode.qio.build.boot_freq=80m
adafruit_metro_esp32s3.menu.FlashMode.qio.build.flash_freq=80m
adafruit_metro_esp32s3.menu.FlashMode.qio120=QIO 120MHz
adafruit_metro_esp32s3.menu.FlashMode.qio120.build.flash_mode=dio
adafruit_metro_esp32s3.menu.FlashMode.qio120.build.boot=qio
adafruit_metro_esp32s3.menu.FlashMode.qio120.build.boot_freq=120m
adafruit_metro_esp32s3.menu.FlashMode.qio120.build.flash_freq=80m
adafruit_metro_esp32s3.menu.FlashMode.dio=DIO 80MHz
adafruit_metro_esp32s3.menu.FlashMode.dio.build.flash_mode=dio
adafruit_metro_esp32s3.menu.FlashMode.dio.build.boot=dio
adafruit_metro_esp32s3.menu.FlashMode.dio.build.boot_freq=80m
adafruit_metro_esp32s3.menu.FlashMode.dio.build.flash_freq=80m
adafruit_metro_esp32s3.menu.FlashMode.opi=OPI 80MHz
adafruit_metro_esp32s3.menu.FlashMode.opi.build.flash_mode=dout
adafruit_metro_esp32s3.menu.FlashMode.opi.build.boot=opi
adafruit_metro_esp32s3.menu.FlashMode.opi.build.boot_freq=80m
adafruit_metro_esp32s3.menu.FlashMode.opi.build.flash_freq=80m

adafruit_metro_esp32s3.menu.FlashSize.16M=16MB (128Mb)
adafruit_metro_esp32s3.menu.FlashSize.16M.build.flash_size=16MB

adafruit_metro_esp32s3.menu.UploadSpeed.921600=921600
adafruit_metro_esp32s3.menu.UploadSpeed.921600.upload.speed=921600
adafruit_metro_esp32s3.menu.UploadSpeed.115200=115200
adafruit_metro_esp32s3.menu.UploadSpeed.115200.upload.speed=115200
adafruit_metro_esp32s3.menu.UploadSpeed.256000.windows=256000
adafruit_metro_esp32s3.menu.UploadSpeed.256000.upload.speed=256000
adafruit_metro_esp32s3.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_metro_esp32s3.menu.UploadSpeed.230400=230400
adafruit_metro_esp32s3.menu.UploadSpeed.230400.upload.speed=230400
adafruit_metro_esp32s3.menu.UploadSpeed.460800.linux=460800
adafruit_metro_esp32s3.menu.UploadSpeed.460800.macosx=460800
adafruit_metro_esp32s3.menu.UploadSpeed.460800.upload.speed=460800
adafruit_metro_esp32s3.menu.UploadSpeed.512000.windows=512000
adafruit_metro_esp32s3.menu.UploadSpeed.512000.upload.speed=512000

