espressif/arduino-esp32/boards.txt
adafruit_funhouse_esp32s2.menu.CPUFreq.240=240MHz (WiFi)
adafruit_funhouse_esp32s2.menu.CPUFreq.240.build.f_cpu=240000000L
adafruit_funhouse_esp32s2.menu.CPUFreq.160=160MHz (WiFi)
adafruit_funhouse_esp32s2.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_funhouse_esp32s2.menu.CPUFreq.80=80MHz (WiFi)
adafruit_funhouse_esp32s2.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_funhouse_esp32s2.menu.CPUFreq.40=40MHz
adafruit_funhouse_esp32s2.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_funhouse_esp32s2.menu.CPUFreq.20=20MHz
adafruit_funhouse_esp32s2.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_funhouse_esp32s2.menu.CPUFreq.10=10MHz
adafruit_funhouse_esp32s2.menu.CPUFreq.10.build.f_cpu=10000000L

adafruit_funhouse_esp32s2.menu.FlashMode.qio=QIO
adafruit_funhouse_esp32s2.menu.FlashMode.qio.build.flash_mode=dio
adafruit_funhouse_esp32s2.menu.FlashMode.qio.build.boot=qio
adafruit_funhouse_esp32s2.menu.FlashMode.dio=DIO
adafruit_funhouse_esp32s2.menu.FlashMode.dio.build.flash_mode=dio
adafruit_funhouse_esp32s2.menu.FlashMode.dio.build.boot=dio

adafruit_funhouse_esp32s2.menu.FlashFreq.80=80MHz
adafruit_funhouse_esp32s2.menu.FlashFreq.80.build.flash_freq=80m
adafruit_funhouse_esp32s2.menu.FlashFreq.40=40MHz
adafruit_funhouse_esp32s2.menu.FlashFreq.40.build.flash_freq=40m

adafruit_funhouse_esp32s2.menu.FlashSize.4M=4MB (32Mb)
adafruit_funhouse_esp32s2.menu.FlashSize.4M.build.flash_size=4MB

adafruit_funhouse_esp32s2.menu.UploadSpeed.921600=921600
adafruit_funhouse_esp32s2.menu.UploadSpeed.921600.upload.speed=921600
adafruit_funhouse_esp32s2.menu.UploadSpeed.115200=115200
adafruit_funhouse_esp32s2.menu.UploadSpeed.115200.upload.speed=115200
adafruit_funhouse_esp32s2.menu.UploadSpeed.256000.windows=256000
adafruit_funhouse_esp32s2.menu.UploadSpeed.256000.upload.speed=256000
adafruit_funhouse_esp32s2.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_funhouse_esp32s2.menu.UploadSpeed.230400=230400
adafruit_funhouse_esp32s2.menu.UploadSpeed.230400.upload.speed=230400
adafruit_funhouse_esp32s2.menu.UploadSpeed.460800.linux=460800
adafruit_funhouse_esp32s2.menu.UploadSpeed.460800.macosx=460800
adafruit_funhouse_esp32s2.menu.UploadSpeed.460800.upload.speed=460800
adafruit_funhouse_esp32s2.menu.UploadSpeed.512000.windows=512000
adafruit_funhouse_esp32s2.menu.UploadSpeed.512000.upload.speed=512000

adafruit_funhouse_esp32s2.menu.DebugLevel.none=None
adafruit_funhouse_esp32s2.menu.DebugLevel.none.build.code_debug=0
adafruit_funhouse_esp32s2.menu.DebugLevel.error=Error
adafruit_funhouse_esp32s2.menu.DebugLevel.error.build.code_debug=1
adafruit_funhouse_esp32s2.menu.DebugLevel.warn=Warn
adafruit_funhouse_esp32s2.menu.DebugLevel.warn.build.code_debug=2
adafruit_funhouse_esp32s2.menu.DebugLevel.info=Info
adafruit_funhouse_esp32s2.menu.DebugLevel.info.build.code_debug=3
adafruit_funhouse_esp32s2.menu.DebugLevel.debug=Debug
adafruit_funhouse_esp32s2.menu.DebugLevel.debug.build.code_debug=4
adafruit_funhouse_esp32s2.menu.DebugLevel.verbose=Verbose
adafruit_funhouse_esp32s2.menu.DebugLevel.verbose.build.code_debug=5

adafruit_funhouse_esp32s2.menu.EraseFlash.none=Disabled
adafruit_funhouse_esp32s2.menu.EraseFlash.none.upload.erase_cmd=
adafruit_funhouse_esp32s2.menu.EraseFlash.all=Enabled
adafruit_funhouse_esp32s2.menu.EraseFlash.all.upload.erase_cmd=-e

adafruit_funhouse_esp32s2.menu.ZigbeeMode.default=Disabled
adafruit_funhouse_esp32s2.menu.ZigbeeMode.default.build.zigbee_mode=
adafruit_funhouse_esp32s2.menu.ZigbeeMode.default.build.zigbee_libs=
adafruit_funhouse_esp32s2.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator)
adafruit_funhouse_esp32s2.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
adafruit_funhouse_esp32s2.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api_zczr -lesp_zb_cli_command -lzboss_stack.zczr.trace -lzboss_stack.zczr -lzboss_port

##############################################################
# Adafruit ESP32 Feather

featheresp32.name=Adafruit ESP32 Feather

featheresp32.bootloader.tool=esptool_py
featheresp32.bootloader.tool.default=esptool_py

featheresp32.upload.tool=esptool_py
featheresp32.upload.tool.default=esptool_py
featheresp32.upload.tool.network=esp_ota

featheresp32.upload.maximum_size=1310720
featheresp32.upload.maximum_data_size=327680
featheresp32.upload.flags=
featheresp32.upload.extra_flags=

featheresp32.serial.disableDTR=true
featheresp32.serial.disableRTS=true

featheresp32.build.tarch=xtensa
featheresp32.build.bootloader_addr=0x1000
featheresp32.build.target=esp32
featheresp32.build.mcu=esp32
featheresp32.build.core=esp32
featheresp32.build.variant=feather_esp32
featheresp32.build.board=FEATHER_ESP32

featheresp32.build.f_cpu=240000000L
featheresp32.build.flash_size=4MB
featheresp32.build.flash_freq=80m
featheresp32.build.flash_mode=dio
featheresp32.build.boot=dio
featheresp32.build.partitions=default
featheresp32.build.defines=
featheresp32.build.loop_core=
featheresp32.build.event_core=

featheresp32.menu.LoopCore.1=Core 1
featheresp32.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
featheresp32.menu.LoopCore.0=Core 0
featheresp32.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

featheresp32.menu.EventsCore.1=Core 1
featheresp32.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
featheresp32.menu.EventsCore.0=Core 0
featheresp32.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

featheresp32.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
featheresp32.menu.PartitionScheme.default.build.partitions=default
featheresp32.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
featheresp32.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
featheresp32.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
featheresp32.menu.PartitionScheme.minimal.build.partitions=minimal
featheresp32.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
featheresp32.menu.PartitionScheme.no_ota.build.partitions=no_ota
featheresp32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
featheresp32.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
featheresp32.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
featheresp32.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
featheresp32.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
featheresp32.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
featheresp32.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
featheresp32.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
featheresp32.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
featheresp32.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
featheresp32.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
featheresp32.menu.PartitionScheme.huge_app.build.partitions=huge_app
featheresp32.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
featheresp32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
featheresp32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
featheresp32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

