espressif/arduino-esp32/boards.txt
adafruit_qtpy_esp32s3_nopsram.menu.CDCOnBoot.cdc=Enabled
adafruit_qtpy_esp32s3_nopsram.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
adafruit_qtpy_esp32s3_nopsram.menu.CDCOnBoot.default=Disabled
adafruit_qtpy_esp32s3_nopsram.menu.CDCOnBoot.default.build.cdc_on_boot=0

adafruit_qtpy_esp32s3_nopsram.menu.MSCOnBoot.default=Disabled
adafruit_qtpy_esp32s3_nopsram.menu.MSCOnBoot.default.build.msc_on_boot=0
adafruit_qtpy_esp32s3_nopsram.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
adafruit_qtpy_esp32s3_nopsram.menu.MSCOnBoot.msc.build.msc_on_boot=1

adafruit_qtpy_esp32s3_nopsram.menu.DFUOnBoot.default=Disabled
adafruit_qtpy_esp32s3_nopsram.menu.DFUOnBoot.default.build.dfu_on_boot=0
adafruit_qtpy_esp32s3_nopsram.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
adafruit_qtpy_esp32s3_nopsram.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

adafruit_qtpy_esp32s3_nopsram.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
adafruit_qtpy_esp32s3_nopsram.menu.UploadMode.cdc.upload.use_1200bps_touch=true
adafruit_qtpy_esp32s3_nopsram.menu.UploadMode.cdc.upload.wait_for_upload_port=true
adafruit_qtpy_esp32s3_nopsram.menu.UploadMode.default=UART0 / Hardware CDC
adafruit_qtpy_esp32s3_nopsram.menu.UploadMode.default.upload.use_1200bps_touch=false
adafruit_qtpy_esp32s3_nopsram.menu.UploadMode.default.upload.wait_for_upload_port=false

adafruit_qtpy_esp32s3_nopsram.menu.PartitionScheme.tinyuf2=TinyUF2 8MB (2MB APP/3.7MB FATFS)
adafruit_qtpy_esp32s3_nopsram.menu.PartitionScheme.tinyuf2.build.custom_bootloader=bootloader-tinyuf2
adafruit_qtpy_esp32s3_nopsram.menu.PartitionScheme.tinyuf2.build.partitions=tinyuf2-partitions-8MB
adafruit_qtpy_esp32s3_nopsram.menu.PartitionScheme.tinyuf2.upload.maximum_size=2097152
adafruit_qtpy_esp32s3_nopsram.menu.PartitionScheme.tinyuf2.upload.extra_flags=0x410000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
adafruit_qtpy_esp32s3_nopsram.menu.PartitionScheme.tinyuf2_noota=TinyUF2 8MB No OTA (4MB APP/3.7MB FATFS)
adafruit_qtpy_esp32s3_nopsram.menu.PartitionScheme.tinyuf2_noota.build.custom_bootloader=bootloader-tinyuf2
adafruit_qtpy_esp32s3_nopsram.menu.PartitionScheme.tinyuf2_noota.build.partitions=tinyuf2-partitions-8MB-noota
adafruit_qtpy_esp32s3_nopsram.menu.PartitionScheme.tinyuf2_noota.upload.maximum_size=4194304
adafruit_qtpy_esp32s3_nopsram.menu.PartitionScheme.tinyuf2_noota.upload.extra_flags=0x410000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
adafruit_qtpy_esp32s3_nopsram.menu.PartitionScheme.default_8MB=Default (3MB APP/1.5MB SPIFFS)
adafruit_qtpy_esp32s3_nopsram.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
adafruit_qtpy_esp32s3_nopsram.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336

adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.240=240MHz (WiFi)
adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.240.build.f_cpu=240000000L
adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.160=160MHz (WiFi)
adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.80=80MHz (WiFi)
adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.40=40MHz
adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.20=20MHz
adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.10=10MHz
adafruit_qtpy_esp32s3_nopsram.menu.CPUFreq.10.build.f_cpu=10000000L

adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.qio=QIO 80MHz
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.qio.build.flash_mode=dio
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.qio.build.boot=qio
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.qio.build.boot_freq=80m
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.qio.build.flash_freq=80m
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.qio120=QIO 120MHz
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.qio120.build.flash_mode=dio
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.qio120.build.boot=qio
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.qio120.build.boot_freq=120m
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.qio120.build.flash_freq=80m
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.dio=DIO 80MHz
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.dio.build.flash_mode=dio
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.dio.build.boot=dio
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.dio.build.boot_freq=80m
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.dio.build.flash_freq=80m
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.opi=OPI 80MHz
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.opi.build.flash_mode=dout
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.opi.build.boot=opi
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.opi.build.boot_freq=80m
adafruit_qtpy_esp32s3_nopsram.menu.FlashMode.opi.build.flash_freq=80m

adafruit_qtpy_esp32s3_nopsram.menu.FlashSize.8M=8MB (64Mb)
adafruit_qtpy_esp32s3_nopsram.menu.FlashSize.8M.build.flash_size=8MB

adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.921600=921600
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.921600.upload.speed=921600
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.115200=115200
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.115200.upload.speed=115200
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.256000.windows=256000
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.256000.upload.speed=256000
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.230400=230400
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.230400.upload.speed=230400
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.460800.linux=460800
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.460800.macosx=460800
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.460800.upload.speed=460800
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.512000.windows=512000
adafruit_qtpy_esp32s3_nopsram.menu.UploadSpeed.512000.upload.speed=512000

adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.none=None
adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.none.build.code_debug=0
adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.error=Error
adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.error.build.code_debug=1
adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.warn=Warn
adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.warn.build.code_debug=2
adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.info=Info
adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.info.build.code_debug=3
adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.debug=Debug
adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.debug.build.code_debug=4
adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.verbose=Verbose
adafruit_qtpy_esp32s3_nopsram.menu.DebugLevel.verbose.build.code_debug=5

adafruit_qtpy_esp32s3_nopsram.menu.EraseFlash.none=Disabled
adafruit_qtpy_esp32s3_nopsram.menu.EraseFlash.none.upload.erase_cmd=
adafruit_qtpy_esp32s3_nopsram.menu.EraseFlash.all=Enabled
adafruit_qtpy_esp32s3_nopsram.menu.EraseFlash.all.upload.erase_cmd=-e

