espressif/arduino-esp32/boards.txt
adafruit_qtpy_esp32s3_nopsram.menu.ZigbeeMode.default=Disabled
adafruit_qtpy_esp32s3_nopsram.menu.ZigbeeMode.default.build.zigbee_mode=
adafruit_qtpy_esp32s3_nopsram.menu.ZigbeeMode.default.build.zigbee_libs=
adafruit_qtpy_esp32s3_nopsram.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator)
adafruit_qtpy_esp32s3_nopsram.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
adafruit_qtpy_esp32s3_nopsram.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api_zczr -lesp_zb_cli_command -lzboss_stack.zczr.trace -lzboss_stack.zczr -lzboss_port

##############################################################
# Adafruit QT Py ESP32-S3 (4M Flash 2M PSRAM)

adafruit_qtpy_esp32s3_n4r2.name=Adafruit QT Py ESP32-S3 (4M Flash 2M PSRAM)
adafruit_qtpy_esp32s3_n4r2.vid.0=0x239A
adafruit_qtpy_esp32s3_n4r2.pid.0=0x8143
adafruit_qtpy_esp32s3_n4r2.vid.1=0x239A
adafruit_qtpy_esp32s3_n4r2.pid.1=0x0143
adafruit_qtpy_esp32s3_n4r2.vid.2=0x239A
adafruit_qtpy_esp32s3_n4r2.pid.2=0x8144

adafruit_qtpy_esp32s3_n4r2.bootloader.tool=esptool_py
adafruit_qtpy_esp32s3_n4r2.bootloader.tool.default=esptool_py

adafruit_qtpy_esp32s3_n4r2.upload.tool=esptool_py
adafruit_qtpy_esp32s3_n4r2.upload.tool.default=esptool_py
adafruit_qtpy_esp32s3_n4r2.upload.tool.network=esp_ota

adafruit_qtpy_esp32s3_n4r2.upload.maximum_size=1310720
adafruit_qtpy_esp32s3_n4r2.upload.maximum_data_size=327680
adafruit_qtpy_esp32s3_n4r2.upload.flags=
adafruit_qtpy_esp32s3_n4r2.upload.extra_flags=
adafruit_qtpy_esp32s3_n4r2.upload.use_1200bps_touch=true
adafruit_qtpy_esp32s3_n4r2.upload.wait_for_upload_port=true

adafruit_qtpy_esp32s3_n4r2.serial.disableDTR=false
adafruit_qtpy_esp32s3_n4r2.serial.disableRTS=false

adafruit_qtpy_esp32s3_n4r2.build.tarch=xtensa
adafruit_qtpy_esp32s3_n4r2.build.bootloader_addr=0x0
adafruit_qtpy_esp32s3_n4r2.build.target=esp32s3
adafruit_qtpy_esp32s3_n4r2.build.mcu=esp32s3
adafruit_qtpy_esp32s3_n4r2.build.core=esp32
adafruit_qtpy_esp32s3_n4r2.build.variant=adafruit_qtpy_esp32s3_n4r2
adafruit_qtpy_esp32s3_n4r2.build.board=ADAFRUIT_QTPY_ESP32S3_N4R2

adafruit_qtpy_esp32s3_n4r2.build.usb_mode=0
adafruit_qtpy_esp32s3_n4r2.build.cdc_on_boot=1
adafruit_qtpy_esp32s3_n4r2.build.msc_on_boot=0
adafruit_qtpy_esp32s3_n4r2.build.dfu_on_boot=0
adafruit_qtpy_esp32s3_n4r2.build.f_cpu=240000000L
adafruit_qtpy_esp32s3_n4r2.build.flash_size=4MB
adafruit_qtpy_esp32s3_n4r2.build.flash_freq=80m
adafruit_qtpy_esp32s3_n4r2.build.flash_mode=dio
adafruit_qtpy_esp32s3_n4r2.build.boot=qio
adafruit_qtpy_esp32s3_n4r2.build.partitions=default
adafruit_qtpy_esp32s3_n4r2.build.defines=
adafruit_qtpy_esp32s3_n4r2.build.loop_core=
adafruit_qtpy_esp32s3_n4r2.build.event_core=
adafruit_qtpy_esp32s3_n4r2.build.flash_type=qio
adafruit_qtpy_esp32s3_n4r2.build.psram_type=qspi
adafruit_qtpy_esp32s3_n4r2.build.memory_type={build.flash_type}_{build.psram_type}

adafruit_qtpy_esp32s3_n4r2.menu.LoopCore.1=Core 1
adafruit_qtpy_esp32s3_n4r2.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
adafruit_qtpy_esp32s3_n4r2.menu.LoopCore.0=Core 0
adafruit_qtpy_esp32s3_n4r2.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

adafruit_qtpy_esp32s3_n4r2.menu.EventsCore.1=Core 1
adafruit_qtpy_esp32s3_n4r2.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
adafruit_qtpy_esp32s3_n4r2.menu.EventsCore.0=Core 0
adafruit_qtpy_esp32s3_n4r2.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

adafruit_qtpy_esp32s3_n4r2.menu.USBMode.default=USB-OTG (TinyUSB)
adafruit_qtpy_esp32s3_n4r2.menu.USBMode.default.build.usb_mode=0
adafruit_qtpy_esp32s3_n4r2.menu.USBMode.hwcdc=Hardware CDC and JTAG
adafruit_qtpy_esp32s3_n4r2.menu.USBMode.hwcdc.build.usb_mode=1

adafruit_qtpy_esp32s3_n4r2.menu.CDCOnBoot.cdc=Enabled
adafruit_qtpy_esp32s3_n4r2.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
adafruit_qtpy_esp32s3_n4r2.menu.CDCOnBoot.default=Disabled
adafruit_qtpy_esp32s3_n4r2.menu.CDCOnBoot.default.build.cdc_on_boot=0

adafruit_qtpy_esp32s3_n4r2.menu.MSCOnBoot.default=Disabled
adafruit_qtpy_esp32s3_n4r2.menu.MSCOnBoot.default.build.msc_on_boot=0
adafruit_qtpy_esp32s3_n4r2.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
adafruit_qtpy_esp32s3_n4r2.menu.MSCOnBoot.msc.build.msc_on_boot=1

adafruit_qtpy_esp32s3_n4r2.menu.DFUOnBoot.default=Disabled
adafruit_qtpy_esp32s3_n4r2.menu.DFUOnBoot.default.build.dfu_on_boot=0
adafruit_qtpy_esp32s3_n4r2.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
adafruit_qtpy_esp32s3_n4r2.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

adafruit_qtpy_esp32s3_n4r2.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
adafruit_qtpy_esp32s3_n4r2.menu.UploadMode.cdc.upload.use_1200bps_touch=true
adafruit_qtpy_esp32s3_n4r2.menu.UploadMode.cdc.upload.wait_for_upload_port=true
adafruit_qtpy_esp32s3_n4r2.menu.UploadMode.default=UART0 / Hardware CDC
adafruit_qtpy_esp32s3_n4r2.menu.UploadMode.default.upload.use_1200bps_touch=false
adafruit_qtpy_esp32s3_n4r2.menu.UploadMode.default.upload.wait_for_upload_port=false

adafruit_qtpy_esp32s3_n4r2.menu.PSRAM.enabled=QSPI PSRAM
adafruit_qtpy_esp32s3_n4r2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
adafruit_qtpy_esp32s3_n4r2.menu.PSRAM.enabled.build.psram_type=qspi
adafruit_qtpy_esp32s3_n4r2.menu.PSRAM.disabled=Disabled
adafruit_qtpy_esp32s3_n4r2.menu.PSRAM.disabled.build.defines=
adafruit_qtpy_esp32s3_n4r2.menu.PSRAM.disabled.build.psram_type=qspi
adafruit_qtpy_esp32s3_n4r2.menu.PSRAM.opi=OPI PSRAM
adafruit_qtpy_esp32s3_n4r2.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
adafruit_qtpy_esp32s3_n4r2.menu.PSRAM.opi.build.psram_type=opi

adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.tinyuf2=TinyUF2 4MB (1.3MB APP/960KB FATFS)
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.tinyuf2.build.custom_bootloader=bootloader-tinyuf2
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.tinyuf2.build.partitions=tinyuf2-partitions-4MB
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.tinyuf2.upload.maximum_size=1441792
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.tinyuf2.upload.extra_flags=0x2d0000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.tinyuf2_noota=TinyUF2 4MB No OTA (2.7MB APP/960KB FATFS)
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.tinyuf2_noota.build.custom_bootloader=bootloader-tinyuf2
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.tinyuf2_noota.build.partitions=tinyuf2-partitions-4MB-noota
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.tinyuf2_noota.upload.maximum_size=2883584
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.tinyuf2_noota.upload.extra_flags=0x2d0000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.default.build.partitions=default
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.minimal.build.partitions=minimal
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.no_ota.build.partitions=no_ota
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.huge_app.build.partitions=huge_app
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
adafruit_qtpy_esp32s3_n4r2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.240=240MHz (WiFi)
adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.240.build.f_cpu=240000000L
adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.160=160MHz (WiFi)
adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.80=80MHz (WiFi)
adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.40=40MHz
adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.20=20MHz
adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.10=10MHz
adafruit_qtpy_esp32s3_n4r2.menu.CPUFreq.10.build.f_cpu=10000000L

