espressif/arduino-esp32/boards.txt
##############################################################

esp32s2-devkitlipo.name=OLIMEX ESP32-S2-DevKit-Lipo
esp32s2-devkitlipo.vid.0=0x303a
esp32s2-devkitlipo.pid.0=0x0002

esp32s2-devkitlipo.bootloader.tool=esptool_py
esp32s2-devkitlipo.bootloader.tool.default=esptool_py

esp32s2-devkitlipo.upload.tool=esptool_py
esp32s2-devkitlipo.upload.tool.default=esptool_py
esp32s2-devkitlipo.upload.tool.network=esp_ota

esp32s2-devkitlipo.upload.maximum_size=1310720
esp32s2-devkitlipo.upload.maximum_data_size=327680
esp32s2-devkitlipo.upload.flags=
esp32s2-devkitlipo.upload.extra_flags=
esp32s2-devkitlipo.upload.use_1200bps_touch=false
esp32s2-devkitlipo.upload.wait_for_upload_port=false

esp32s2-devkitlipo.serial.disableDTR=false
esp32s2-devkitlipo.serial.disableRTS=false

esp32s2-devkitlipo.build.tarch=xtensa
esp32s2-devkitlipo.build.bootloader_addr=0x1000
esp32s2-devkitlipo.build.target=esp32s2
esp32s2-devkitlipo.build.mcu=esp32s2
esp32s2-devkitlipo.build.core=esp32
esp32s2-devkitlipo.build.variant=esp32s2-devkit-lipo
esp32s2-devkitlipo.build.board=ESP32S2_DEVKIT_LIPO

esp32s2-devkitlipo.build.cdc_on_boot=0
esp32s2-devkitlipo.build.msc_on_boot=0
esp32s2-devkitlipo.build.dfu_on_boot=0
esp32s2-devkitlipo.build.f_cpu=240000000L
esp32s2-devkitlipo.build.flash_size=4MB
esp32s2-devkitlipo.build.flash_freq=80m
esp32s2-devkitlipo.build.flash_mode=dio
esp32s2-devkitlipo.build.boot=qio
esp32s2-devkitlipo.build.partitions=default
esp32s2-devkitlipo.build.defines=

esp32s2-devkitlipo.menu.JTAGAdapter.default=Disabled
esp32s2-devkitlipo.menu.JTAGAdapter.default.build.copy_jtag_files=0
esp32s2-devkitlipo.menu.JTAGAdapter.external=FTDI Adapter
esp32s2-devkitlipo.menu.JTAGAdapter.external.build.openocdscript=esp32s2-kaluga-1.cfg
esp32s2-devkitlipo.menu.JTAGAdapter.external.build.copy_jtag_files=1
esp32s2-devkitlipo.menu.JTAGAdapter.bridge=ESP USB Bridge
esp32s2-devkitlipo.menu.JTAGAdapter.bridge.build.openocdscript=esp32s2-bridge.cfg
esp32s2-devkitlipo.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

esp32s2-devkitlipo.menu.CDCOnBoot.default=Disabled
esp32s2-devkitlipo.menu.CDCOnBoot.default.build.cdc_on_boot=0
esp32s2-devkitlipo.menu.CDCOnBoot.cdc=Enabled
esp32s2-devkitlipo.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

esp32s2-devkitlipo.menu.MSCOnBoot.default=Disabled
esp32s2-devkitlipo.menu.MSCOnBoot.default.build.msc_on_boot=0
esp32s2-devkitlipo.menu.MSCOnBoot.msc=Enabled
esp32s2-devkitlipo.menu.MSCOnBoot.msc.build.msc_on_boot=1

esp32s2-devkitlipo.menu.DFUOnBoot.default=Disabled
esp32s2-devkitlipo.menu.DFUOnBoot.default.build.dfu_on_boot=0
esp32s2-devkitlipo.menu.DFUOnBoot.dfu=Enabled
esp32s2-devkitlipo.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

esp32s2-devkitlipo.menu.UploadMode.default=UART0
esp32s2-devkitlipo.menu.UploadMode.default.upload.use_1200bps_touch=false
esp32s2-devkitlipo.menu.UploadMode.default.upload.wait_for_upload_port=false
esp32s2-devkitlipo.menu.UploadMode.cdc=Internal USB
esp32s2-devkitlipo.menu.UploadMode.cdc.upload.use_1200bps_touch=true
esp32s2-devkitlipo.menu.UploadMode.cdc.upload.wait_for_upload_port=true

esp32s2-devkitlipo.menu.PSRAM.disabled=Disabled (WROOM)
esp32s2-devkitlipo.menu.PSRAM.disabled.build.defines=
esp32s2-devkitlipo.menu.PSRAM.enabled=Enabled (WROVER)
esp32s2-devkitlipo.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM

esp32s2-devkitlipo.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
esp32s2-devkitlipo.menu.PartitionScheme.default.build.partitions=default
esp32s2-devkitlipo.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
esp32s2-devkitlipo.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
esp32s2-devkitlipo.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
esp32s2-devkitlipo.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
esp32s2-devkitlipo.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
esp32s2-devkitlipo.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
esp32s2-devkitlipo.menu.PartitionScheme.minimal.build.partitions=minimal
esp32s2-devkitlipo.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
esp32s2-devkitlipo.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32s2-devkitlipo.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32s2-devkitlipo.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
esp32s2-devkitlipo.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
esp32s2-devkitlipo.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
esp32s2-devkitlipo.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
esp32s2-devkitlipo.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
esp32s2-devkitlipo.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
esp32s2-devkitlipo.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
esp32s2-devkitlipo.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
esp32s2-devkitlipo.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
esp32s2-devkitlipo.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
esp32s2-devkitlipo.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32s2-devkitlipo.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32s2-devkitlipo.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
esp32s2-devkitlipo.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32s2-devkitlipo.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32s2-devkitlipo.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
esp32s2-devkitlipo.menu.PartitionScheme.fatflash.build.partitions=ffat
esp32s2-devkitlipo.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
esp32s2-devkitlipo.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
esp32s2-devkitlipo.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
esp32s2-devkitlipo.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
esp32s2-devkitlipo.menu.PartitionScheme.rainmaker=RainMaker
esp32s2-devkitlipo.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
esp32s2-devkitlipo.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728
esp32s2-devkitlipo.menu.PartitionScheme.custom=Custom
esp32s2-devkitlipo.menu.PartitionScheme.custom.build.partitions=
esp32s2-devkitlipo.menu.PartitionScheme.custom.upload.maximum_size=16777216

esp32s2-devkitlipo.menu.CPUFreq.240=240MHz (WiFi)
esp32s2-devkitlipo.menu.CPUFreq.240.build.f_cpu=240000000L
esp32s2-devkitlipo.menu.CPUFreq.160=160MHz (WiFi)
esp32s2-devkitlipo.menu.CPUFreq.160.build.f_cpu=160000000L
esp32s2-devkitlipo.menu.CPUFreq.80=80MHz (WiFi)
esp32s2-devkitlipo.menu.CPUFreq.80.build.f_cpu=80000000L
esp32s2-devkitlipo.menu.CPUFreq.40=40MHz
esp32s2-devkitlipo.menu.CPUFreq.40.build.f_cpu=40000000L
esp32s2-devkitlipo.menu.CPUFreq.20=20MHz
esp32s2-devkitlipo.menu.CPUFreq.20.build.f_cpu=20000000L
esp32s2-devkitlipo.menu.CPUFreq.10=10MHz
esp32s2-devkitlipo.menu.CPUFreq.10.build.f_cpu=10000000L

