espressif/arduino-esp32/boards.txt
esp32s2-devkitlipo.menu.FlashMode.qio=QIO
esp32s2-devkitlipo.menu.FlashMode.qio.build.flash_mode=dio
esp32s2-devkitlipo.menu.FlashMode.qio.build.boot=qio
esp32s2-devkitlipo.menu.FlashMode.dio=DIO
esp32s2-devkitlipo.menu.FlashMode.dio.build.flash_mode=dio
esp32s2-devkitlipo.menu.FlashMode.dio.build.boot=dio
esp32s2-devkitlipo.menu.FlashMode.qout=QOUT
esp32s2-devkitlipo.menu.FlashMode.qout.build.flash_mode=dout
esp32s2-devkitlipo.menu.FlashMode.qout.build.boot=qout
esp32s2-devkitlipo.menu.FlashMode.dout=DOUT
esp32s2-devkitlipo.menu.FlashMode.dout.build.flash_mode=dout
esp32s2-devkitlipo.menu.FlashMode.dout.build.boot=dout

esp32s2-devkitlipo.menu.FlashFreq.80=80MHz
esp32s2-devkitlipo.menu.FlashFreq.80.build.flash_freq=80m
esp32s2-devkitlipo.menu.FlashFreq.40=40MHz
esp32s2-devkitlipo.menu.FlashFreq.40.build.flash_freq=40m

esp32s2-devkitlipo.menu.FlashSize.4M=4MB (32Mb)
esp32s2-devkitlipo.menu.FlashSize.4M.build.flash_size=4MB
esp32s2-devkitlipo.menu.FlashSize.8M=8MB (64Mb)
esp32s2-devkitlipo.menu.FlashSize.8M.build.flash_size=8MB
esp32s2-devkitlipo.menu.FlashSize.8M.build.partitions=default_8MB
esp32s2-devkitlipo.menu.FlashSize.2M=2MB (16Mb)
esp32s2-devkitlipo.menu.FlashSize.2M.build.flash_size=2MB
esp32s2-devkitlipo.menu.FlashSize.2M.build.partitions=minimal
esp32s2-devkitlipo.menu.FlashSize.16M=16MB (128Mb)
esp32s2-devkitlipo.menu.FlashSize.16M.build.flash_size=16MB

esp32s2-devkitlipo.menu.UploadSpeed.921600=921600
esp32s2-devkitlipo.menu.UploadSpeed.921600.upload.speed=921600
esp32s2-devkitlipo.menu.UploadSpeed.115200=115200
esp32s2-devkitlipo.menu.UploadSpeed.115200.upload.speed=115200
esp32s2-devkitlipo.menu.UploadSpeed.256000.windows=256000
esp32s2-devkitlipo.menu.UploadSpeed.256000.upload.speed=256000
esp32s2-devkitlipo.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32s2-devkitlipo.menu.UploadSpeed.230400=230400
esp32s2-devkitlipo.menu.UploadSpeed.230400.upload.speed=230400
esp32s2-devkitlipo.menu.UploadSpeed.460800.linux=460800
esp32s2-devkitlipo.menu.UploadSpeed.460800.macosx=460800
esp32s2-devkitlipo.menu.UploadSpeed.460800.upload.speed=460800
esp32s2-devkitlipo.menu.UploadSpeed.512000.windows=512000
esp32s2-devkitlipo.menu.UploadSpeed.512000.upload.speed=512000

esp32s2-devkitlipo.menu.DebugLevel.none=None
esp32s2-devkitlipo.menu.DebugLevel.none.build.code_debug=0
esp32s2-devkitlipo.menu.DebugLevel.error=Error
esp32s2-devkitlipo.menu.DebugLevel.error.build.code_debug=1
esp32s2-devkitlipo.menu.DebugLevel.warn=Warn
esp32s2-devkitlipo.menu.DebugLevel.warn.build.code_debug=2
esp32s2-devkitlipo.menu.DebugLevel.info=Info
esp32s2-devkitlipo.menu.DebugLevel.info.build.code_debug=3
esp32s2-devkitlipo.menu.DebugLevel.debug=Debug
esp32s2-devkitlipo.menu.DebugLevel.debug.build.code_debug=4
esp32s2-devkitlipo.menu.DebugLevel.verbose=Verbose
esp32s2-devkitlipo.menu.DebugLevel.verbose.build.code_debug=5

esp32s2-devkitlipo.menu.EraseFlash.none=Disabled
esp32s2-devkitlipo.menu.EraseFlash.none.upload.erase_cmd=
esp32s2-devkitlipo.menu.EraseFlash.all=Enabled
esp32s2-devkitlipo.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

esp32s2-devkitlipo-usb.name=OLIMEX ESP32-S2-DevKit-Lipo-USB
esp32s2-devkitlipo-usb.vid.0=0x303a
esp32s2-devkitlipo-usb.pid.0=0x0002

esp32s2-devkitlipo-usb.bootloader.tool=esptool_py
esp32s2-devkitlipo-usb.bootloader.tool.default=esptool_py

esp32s2-devkitlipo-usb.upload.tool=esptool_py
esp32s2-devkitlipo-usb.upload.tool.default=esptool_py
esp32s2-devkitlipo-usb.upload.tool.network=esp_ota

esp32s2-devkitlipo-usb.upload.maximum_size=1310720
esp32s2-devkitlipo-usb.upload.maximum_data_size=327680
esp32s2-devkitlipo-usb.upload.flags=
esp32s2-devkitlipo-usb.upload.extra_flags=
esp32s2-devkitlipo-usb.upload.use_1200bps_touch=false
esp32s2-devkitlipo-usb.upload.wait_for_upload_port=false

esp32s2-devkitlipo-usb.serial.disableDTR=false
esp32s2-devkitlipo-usb.serial.disableRTS=false

esp32s2-devkitlipo-usb.build.tarch=xtensa
esp32s2-devkitlipo-usb.build.bootloader_addr=0x1000
esp32s2-devkitlipo-usb.build.target=esp32s2
esp32s2-devkitlipo-usb.build.mcu=esp32s2
esp32s2-devkitlipo-usb.build.core=esp32
esp32s2-devkitlipo-usb.build.variant=esp32s2-devkit-lipo-usb
esp32s2-devkitlipo-usb.build.board=ESP32S2_DEVKIT_LIPO_USB

esp32s2-devkitlipo-usb.build.cdc_on_boot=0
esp32s2-devkitlipo-usb.build.msc_on_boot=0
esp32s2-devkitlipo-usb.build.dfu_on_boot=0
esp32s2-devkitlipo-usb.build.f_cpu=240000000L
esp32s2-devkitlipo-usb.build.flash_size=4MB
esp32s2-devkitlipo-usb.build.flash_freq=80m
esp32s2-devkitlipo-usb.build.flash_mode=dio
esp32s2-devkitlipo-usb.build.boot=qio
esp32s2-devkitlipo-usb.build.partitions=default
esp32s2-devkitlipo-usb.build.defines=

esp32s2-devkitlipo-usb.menu.JTAGAdapter.default=Disabled
esp32s2-devkitlipo-usb.menu.JTAGAdapter.default.build.copy_jtag_files=0
esp32s2-devkitlipo-usb.menu.JTAGAdapter.external=FTDI Adapter
esp32s2-devkitlipo-usb.menu.JTAGAdapter.external.build.openocdscript=esp32s2-kaluga-1.cfg
esp32s2-devkitlipo-usb.menu.JTAGAdapter.external.build.copy_jtag_files=1
esp32s2-devkitlipo-usb.menu.JTAGAdapter.bridge=ESP USB Bridge
esp32s2-devkitlipo-usb.menu.JTAGAdapter.bridge.build.openocdscript=esp32s2-bridge.cfg
esp32s2-devkitlipo-usb.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

esp32s2-devkitlipo-usb.menu.CDCOnBoot.default=Enabled
esp32s2-devkitlipo-usb.menu.CDCOnBoot.default.build.cdc_on_boot=1
esp32s2-devkitlipo-usb.menu.CDCOnBoot.cdc=Disabled
esp32s2-devkitlipo-usb.menu.CDCOnBoot.cdc.build.cdc_on_boot=0

esp32s2-devkitlipo-usb.menu.MSCOnBoot.default=Disabled
esp32s2-devkitlipo-usb.menu.MSCOnBoot.default.build.msc_on_boot=0
esp32s2-devkitlipo-usb.menu.MSCOnBoot.msc=Enabled
esp32s2-devkitlipo-usb.menu.MSCOnBoot.msc.build.msc_on_boot=1

esp32s2-devkitlipo-usb.menu.DFUOnBoot.default=Enabled
esp32s2-devkitlipo-usb.menu.DFUOnBoot.default.build.dfu_on_boot=1
esp32s2-devkitlipo-usb.menu.DFUOnBoot.dfu=Disabled
esp32s2-devkitlipo-usb.menu.DFUOnBoot.dfu.build.dfu_on_boot=0

esp32s2-devkitlipo-usb.menu.UploadMode.default=Internal USB
esp32s2-devkitlipo-usb.menu.UploadMode.default.upload.use_1200bps_touch=true
esp32s2-devkitlipo-usb.menu.UploadMode.default.upload.wait_for_upload_port=true
esp32s2-devkitlipo-usb.menu.UploadMode.UART0=UART0
esp32s2-devkitlipo-usb.menu.UploadMode.UART0.upload.use_1200bps_touch=false
esp32s2-devkitlipo-usb.menu.UploadMode.UART0.upload.wait_for_upload_port=false

esp32s2-devkitlipo-usb.menu.PSRAM.disabled=Disabled (WROOM)
esp32s2-devkitlipo-usb.menu.PSRAM.disabled.build.defines=
esp32s2-devkitlipo-usb.menu.PSRAM.enabled=Enabled (WROVER)
esp32s2-devkitlipo-usb.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM

