espressif/arduino-esp32/boards.txt
##############################################################

esp32s3-devkitlipo.name=OLIMEX ESP32-S3-DevKit-Lipo
esp32s3-devkitlipo.vid.0=0x303a
esp32s3-devkitlipo.pid.0=0x1001

esp32s3-devkitlipo.bootloader.tool=esptool_py
esp32s3-devkitlipo.bootloader.tool.default=esptool_py

esp32s3-devkitlipo.upload.tool=esptool_py
esp32s3-devkitlipo.upload.tool.default=esptool_py
esp32s3-devkitlipo.upload.tool.network=esp_ota

esp32s3-devkitlipo.upload.maximum_size=1310720
esp32s3-devkitlipo.upload.maximum_data_size=327680
esp32s3-devkitlipo.upload.flags=
esp32s3-devkitlipo.upload.extra_flags=
esp32s3-devkitlipo.upload.use_1200bps_touch=false
esp32s3-devkitlipo.upload.wait_for_upload_port=false

esp32s3-devkitlipo.serial.disableDTR=false
esp32s3-devkitlipo.serial.disableRTS=false

esp32s3-devkitlipo.build.tarch=xtensa
esp32s3-devkitlipo.build.bootloader_addr=0x0
esp32s3-devkitlipo.build.target=esp32s3
esp32s3-devkitlipo.build.mcu=esp32s3
esp32s3-devkitlipo.build.core=esp32
esp32s3-devkitlipo.build.variant=esp32s3-devkit-lipo
esp32s3-devkitlipo.build.board=ESP32S3_DEVKIT_LIPO

esp32s3-devkitlipo.build.usb_mode=1
esp32s3-devkitlipo.build.cdc_on_boot=0
esp32s3-devkitlipo.build.msc_on_boot=0
esp32s3-devkitlipo.build.dfu_on_boot=0
esp32s3-devkitlipo.build.f_cpu=240000000L
esp32s3-devkitlipo.build.flash_size=4MB
esp32s3-devkitlipo.build.flash_freq=80m
esp32s3-devkitlipo.build.flash_mode=dio
esp32s3-devkitlipo.build.boot=qio
esp32s3-devkitlipo.build.boot_freq=80m
esp32s3-devkitlipo.build.partitions=default
esp32s3-devkitlipo.build.defines=
esp32s3-devkitlipo.build.loop_core=
esp32s3-devkitlipo.build.event_core=
esp32s3-devkitlipo.build.psram_type=qspi
esp32s3-devkitlipo.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
esp32s3-devkitlipo.menu.JTAGAdapter.default=Disabled
esp32s3-devkitlipo.menu.JTAGAdapter.default.build.copy_jtag_files=0
esp32s3-devkitlipo.menu.JTAGAdapter.builtin=Integrated USB JTAG
esp32s3-devkitlipo.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
esp32s3-devkitlipo.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
esp32s3-devkitlipo.menu.JTAGAdapter.external=FTDI Adapter
esp32s3-devkitlipo.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
esp32s3-devkitlipo.menu.JTAGAdapter.external.build.copy_jtag_files=1
esp32s3-devkitlipo.menu.JTAGAdapter.bridge=ESP USB Bridge
esp32s3-devkitlipo.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
esp32s3-devkitlipo.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

esp32s3-devkitlipo.menu.PSRAM.disabled=Disabled
esp32s3-devkitlipo.menu.PSRAM.disabled.build.defines=
esp32s3-devkitlipo.menu.PSRAM.disabled.build.psram_type=qspi
esp32s3-devkitlipo.menu.PSRAM.enabled=QSPI PSRAM
esp32s3-devkitlipo.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
esp32s3-devkitlipo.menu.PSRAM.enabled.build.psram_type=qspi
esp32s3-devkitlipo.menu.PSRAM.opi=OPI PSRAM
esp32s3-devkitlipo.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
esp32s3-devkitlipo.menu.PSRAM.opi.build.psram_type=opi

esp32s3-devkitlipo.menu.FlashMode.qio=QIO 80MHz
esp32s3-devkitlipo.menu.FlashMode.qio.build.flash_mode=dio
esp32s3-devkitlipo.menu.FlashMode.qio.build.boot=qio
esp32s3-devkitlipo.menu.FlashMode.qio.build.boot_freq=80m
esp32s3-devkitlipo.menu.FlashMode.qio.build.flash_freq=80m
esp32s3-devkitlipo.menu.FlashMode.qio120=QIO 120MHz
esp32s3-devkitlipo.menu.FlashMode.qio120.build.flash_mode=dio
esp32s3-devkitlipo.menu.FlashMode.qio120.build.boot=qio
esp32s3-devkitlipo.menu.FlashMode.qio120.build.boot_freq=120m
esp32s3-devkitlipo.menu.FlashMode.qio120.build.flash_freq=80m
esp32s3-devkitlipo.menu.FlashMode.dio=DIO 80MHz
esp32s3-devkitlipo.menu.FlashMode.dio.build.flash_mode=dio
esp32s3-devkitlipo.menu.FlashMode.dio.build.boot=dio
esp32s3-devkitlipo.menu.FlashMode.dio.build.boot_freq=80m
esp32s3-devkitlipo.menu.FlashMode.dio.build.flash_freq=80m
esp32s3-devkitlipo.menu.FlashMode.opi=OPI 80MHz
esp32s3-devkitlipo.menu.FlashMode.opi.build.flash_mode=dout
esp32s3-devkitlipo.menu.FlashMode.opi.build.boot=opi
esp32s3-devkitlipo.menu.FlashMode.opi.build.boot_freq=80m
esp32s3-devkitlipo.menu.FlashMode.opi.build.flash_freq=80m

esp32s3-devkitlipo.menu.FlashSize.4M=4MB (32Mb)
esp32s3-devkitlipo.menu.FlashSize.4M.build.flash_size=4MB
esp32s3-devkitlipo.menu.FlashSize.8M=8MB (64Mb)
esp32s3-devkitlipo.menu.FlashSize.8M.build.flash_size=8MB
esp32s3-devkitlipo.menu.FlashSize.8M.build.partitions=default_8MB
esp32s3-devkitlipo.menu.FlashSize.16M=16MB (128Mb)
esp32s3-devkitlipo.menu.FlashSize.16M.build.flash_size=16MB
esp32s3-devkitlipo.menu.FlashSize.32M=32MB (256Mb)
esp32s3-devkitlipo.menu.FlashSize.32M.build.flash_size=32MB
esp32s3-devkitlipo.menu.FlashSize.32M.build.partitions=app5M_fat24M_32MB

esp32s3-devkitlipo.menu.LoopCore.1=Core 1
esp32s3-devkitlipo.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
esp32s3-devkitlipo.menu.LoopCore.0=Core 0
esp32s3-devkitlipo.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

esp32s3-devkitlipo.menu.EventsCore.1=Core 1
esp32s3-devkitlipo.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
esp32s3-devkitlipo.menu.EventsCore.0=Core 0
esp32s3-devkitlipo.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

esp32s3-devkitlipo.menu.USBMode.hwcdc=Hardware CDC and JTAG
esp32s3-devkitlipo.menu.USBMode.hwcdc.build.usb_mode=1
esp32s3-devkitlipo.menu.USBMode.default=USB-OTG (TinyUSB)
esp32s3-devkitlipo.menu.USBMode.default.build.usb_mode=0

esp32s3-devkitlipo.menu.CDCOnBoot.default=Disabled
esp32s3-devkitlipo.menu.CDCOnBoot.default.build.cdc_on_boot=0
esp32s3-devkitlipo.menu.CDCOnBoot.cdc=Enabled
esp32s3-devkitlipo.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

esp32s3-devkitlipo.menu.MSCOnBoot.default=Disabled
esp32s3-devkitlipo.menu.MSCOnBoot.default.build.msc_on_boot=0
esp32s3-devkitlipo.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
esp32s3-devkitlipo.menu.MSCOnBoot.msc.build.msc_on_boot=1

esp32s3-devkitlipo.menu.DFUOnBoot.default=Disabled
esp32s3-devkitlipo.menu.DFUOnBoot.default.build.dfu_on_boot=0
esp32s3-devkitlipo.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
esp32s3-devkitlipo.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

