espressif/arduino-esp32/boards.txt
esp32s3-devkitlipo.menu.UploadMode.default=UART0 / Hardware CDC
esp32s3-devkitlipo.menu.UploadMode.default.upload.use_1200bps_touch=false
esp32s3-devkitlipo.menu.UploadMode.default.upload.wait_for_upload_port=false
esp32s3-devkitlipo.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
esp32s3-devkitlipo.menu.UploadMode.cdc.upload.use_1200bps_touch=true
esp32s3-devkitlipo.menu.UploadMode.cdc.upload.wait_for_upload_port=true

esp32s3-devkitlipo.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
esp32s3-devkitlipo.menu.PartitionScheme.default.build.partitions=default
esp32s3-devkitlipo.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
esp32s3-devkitlipo.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
esp32s3-devkitlipo.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
esp32s3-devkitlipo.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
esp32s3-devkitlipo.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
esp32s3-devkitlipo.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
esp32s3-devkitlipo.menu.PartitionScheme.minimal.build.partitions=minimal
esp32s3-devkitlipo.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
esp32s3-devkitlipo.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32s3-devkitlipo.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32s3-devkitlipo.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
esp32s3-devkitlipo.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
esp32s3-devkitlipo.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
esp32s3-devkitlipo.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
esp32s3-devkitlipo.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
esp32s3-devkitlipo.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
esp32s3-devkitlipo.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
esp32s3-devkitlipo.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
esp32s3-devkitlipo.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
esp32s3-devkitlipo.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
esp32s3-devkitlipo.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32s3-devkitlipo.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32s3-devkitlipo.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
esp32s3-devkitlipo.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32s3-devkitlipo.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32s3-devkitlipo.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
esp32s3-devkitlipo.menu.PartitionScheme.fatflash.build.partitions=ffat
esp32s3-devkitlipo.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
esp32s3-devkitlipo.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
esp32s3-devkitlipo.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
esp32s3-devkitlipo.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
esp32s3-devkitlipo.menu.PartitionScheme.rainmaker=RainMaker
esp32s3-devkitlipo.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
esp32s3-devkitlipo.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728
esp32s3-devkitlipo.menu.PartitionScheme.app5M_fat24M_32MB=32M Flash (4.8MB APP/22MB FATFS)
esp32s3-devkitlipo.menu.PartitionScheme.app5M_fat24M_32MB.build.partitions=large_fat_32MB
esp32s3-devkitlipo.menu.PartitionScheme.app5M_fat24M_32MB.upload.maximum_size=4718592
esp32s3-devkitlipo.menu.PartitionScheme.app5M_little24M_32MB=32M Flash (4.8MB APP/22MB LittleFS)
esp32s3-devkitlipo.menu.PartitionScheme.app5M_little24M_32MB.build.partitions=large_littlefs_32MB
esp32s3-devkitlipo.menu.PartitionScheme.app5M_little24M_32MB.upload.maximum_size=4718592
esp32s3-devkitlipo.menu.PartitionScheme.esp_sr_16=ESP SR 16M (3MB APP/7MB SPIFFS/2.9MB MODEL)
esp32s3-devkitlipo.menu.PartitionScheme.esp_sr_16.upload.maximum_size=3145728
esp32s3-devkitlipo.menu.PartitionScheme.esp_sr_16.upload.extra_flags=0xD10000 {build.path}/srmodels.bin
esp32s3-devkitlipo.menu.PartitionScheme.esp_sr_16.build.partitions=esp_sr_16
esp32s3-devkitlipo.menu.PartitionScheme.custom=Custom
esp32s3-devkitlipo.menu.PartitionScheme.custom.build.partitions=
esp32s3-devkitlipo.menu.PartitionScheme.custom.upload.maximum_size=16777216

esp32s3-devkitlipo.menu.CPUFreq.240=240MHz (WiFi)
esp32s3-devkitlipo.menu.CPUFreq.240.build.f_cpu=240000000L
esp32s3-devkitlipo.menu.CPUFreq.160=160MHz (WiFi)
esp32s3-devkitlipo.menu.CPUFreq.160.build.f_cpu=160000000L
esp32s3-devkitlipo.menu.CPUFreq.80=80MHz (WiFi)
esp32s3-devkitlipo.menu.CPUFreq.80.build.f_cpu=80000000L
esp32s3-devkitlipo.menu.CPUFreq.40=40MHz
esp32s3-devkitlipo.menu.CPUFreq.40.build.f_cpu=40000000L
esp32s3-devkitlipo.menu.CPUFreq.20=20MHz
esp32s3-devkitlipo.menu.CPUFreq.20.build.f_cpu=20000000L
esp32s3-devkitlipo.menu.CPUFreq.10=10MHz
esp32s3-devkitlipo.menu.CPUFreq.10.build.f_cpu=10000000L

esp32s3-devkitlipo.menu.UploadSpeed.921600=921600
esp32s3-devkitlipo.menu.UploadSpeed.921600.upload.speed=921600
esp32s3-devkitlipo.menu.UploadSpeed.115200=115200
esp32s3-devkitlipo.menu.UploadSpeed.115200.upload.speed=115200
esp32s3-devkitlipo.menu.UploadSpeed.256000.windows=256000
esp32s3-devkitlipo.menu.UploadSpeed.256000.upload.speed=256000
esp32s3-devkitlipo.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32s3-devkitlipo.menu.UploadSpeed.230400=230400
esp32s3-devkitlipo.menu.UploadSpeed.230400.upload.speed=230400
esp32s3-devkitlipo.menu.UploadSpeed.460800.linux=460800
esp32s3-devkitlipo.menu.UploadSpeed.460800.macosx=460800
esp32s3-devkitlipo.menu.UploadSpeed.460800.upload.speed=460800
esp32s3-devkitlipo.menu.UploadSpeed.512000.windows=512000
esp32s3-devkitlipo.menu.UploadSpeed.512000.upload.speed=512000

esp32s3-devkitlipo.menu.DebugLevel.none=None
esp32s3-devkitlipo.menu.DebugLevel.none.build.code_debug=0
esp32s3-devkitlipo.menu.DebugLevel.error=Error
esp32s3-devkitlipo.menu.DebugLevel.error.build.code_debug=1
esp32s3-devkitlipo.menu.DebugLevel.warn=Warn
esp32s3-devkitlipo.menu.DebugLevel.warn.build.code_debug=2
esp32s3-devkitlipo.menu.DebugLevel.info=Info
esp32s3-devkitlipo.menu.DebugLevel.info.build.code_debug=3
esp32s3-devkitlipo.menu.DebugLevel.debug=Debug
esp32s3-devkitlipo.menu.DebugLevel.debug.build.code_debug=4
esp32s3-devkitlipo.menu.DebugLevel.verbose=Verbose
esp32s3-devkitlipo.menu.DebugLevel.verbose.build.code_debug=5

esp32s3-devkitlipo.menu.EraseFlash.none=Disabled
esp32s3-devkitlipo.menu.EraseFlash.none.upload.erase_cmd=
esp32s3-devkitlipo.menu.EraseFlash.all=Enabled
esp32s3-devkitlipo.menu.EraseFlash.all.upload.erase_cmd=-e
     
