espressif/arduino-esp32/boards.txt
heltec_wifi_kit_32.menu.DebugLevel.none=None
heltec_wifi_kit_32.menu.DebugLevel.none.build.code_debug=0
heltec_wifi_kit_32.menu.DebugLevel.error=Error
heltec_wifi_kit_32.menu.DebugLevel.error.build.code_debug=1
heltec_wifi_kit_32.menu.DebugLevel.warn=Warn
heltec_wifi_kit_32.menu.DebugLevel.warn.build.code_debug=2
heltec_wifi_kit_32.menu.DebugLevel.info=Info
heltec_wifi_kit_32.menu.DebugLevel.info.build.code_debug=3
heltec_wifi_kit_32.menu.DebugLevel.debug=Debug
heltec_wifi_kit_32.menu.DebugLevel.debug.build.code_debug=4
heltec_wifi_kit_32.menu.DebugLevel.verbose=Verbose
heltec_wifi_kit_32.menu.DebugLevel.verbose.build.code_debug=5

heltec_wifi_kit_32.menu.EraseFlash.none=Disabled
heltec_wifi_kit_32.menu.EraseFlash.none.upload.erase_cmd=
heltec_wifi_kit_32.menu.EraseFlash.all=Enabled
heltec_wifi_kit_32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

heltec_wifi_kit_32_V3.name=Heltec WiFi Kit 32(V3)

heltec_wifi_kit_32_V3.vid.0=0x303a
heltec_wifi_kit_32_V3.pid.0=0x1001

heltec_wifi_kit_32_V3.bootloader.tool=esptool_py
heltec_wifi_kit_32_V3.bootloader.tool.default=esptool_py

heltec_wifi_kit_32_V3.upload.tool=esptool_py
heltec_wifi_kit_32_V3.upload.tool.default=esptool_py
heltec_wifi_kit_32_V3.upload.tool.network=esp_ota

heltec_wifi_kit_32_V3.upload.maximum_size=3342336
heltec_wifi_kit_32_V3.upload.maximum_data_size=327680
heltec_wifi_kit_32_V3.upload.flags=
heltec_wifi_kit_32_V3.upload.extra_flags=
heltec_wifi_kit_32_V3.upload.use_1200bps_touch=false
heltec_wifi_kit_32_V3.upload.wait_for_upload_port=false

heltec_wifi_kit_32_V3.serial.disableDTR=false
heltec_wifi_kit_32_V3.serial.disableRTS=false

heltec_wifi_kit_32_V3.build.tarch=xtensa
heltec_wifi_kit_32_V3.build.bootloader_addr=0x0
heltec_wifi_kit_32_V3.build.target=esp32s3
heltec_wifi_kit_32_V3.build.mcu=esp32s3
heltec_wifi_kit_32_V3.build.core=esp32
heltec_wifi_kit_32_V3.build.variant=heltec_wifi_kit_32_V3
heltec_wifi_kit_32_V3.build.board=HELTEC_WIFI_KIT_32_V3

heltec_wifi_kit_32_V3.build.usb_mode=1
heltec_wifi_kit_32_V3.build.cdc_on_boot=0
heltec_wifi_kit_32_V3.build.msc_on_boot=0
heltec_wifi_kit_32_V3.build.dfu_on_boot=0
heltec_wifi_kit_32_V3.build.f_cpu=240000000L
heltec_wifi_kit_32_V3.build.flash_size=8MB
heltec_wifi_kit_32_V3.build.flash_freq=80m
heltec_wifi_kit_32_V3.build.flash_mode=dio
heltec_wifi_kit_32_V3.build.boot=qio
heltec_wifi_kit_32_V3.build.boot_freq=80m
heltec_wifi_kit_32_V3.build.partitions=default_8MB
heltec_wifi_kit_32_V3.build.loop_core=
heltec_wifi_kit_32_V3.build.event_core=
heltec_wifi_kit_32_V3.build.psram_type=qspi
heltec_wifi_kit_32_V3.build.memory_type={build.boot}_{build.psram_type}

heltec_wifi_kit_32_V3.menu.LoopCore.1=Core 1
heltec_wifi_kit_32_V3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
heltec_wifi_kit_32_V3.menu.LoopCore.0=Core 0
heltec_wifi_kit_32_V3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

heltec_wifi_kit_32_V3.menu.EventsCore.1=Core 1
heltec_wifi_kit_32_V3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
heltec_wifi_kit_32_V3.menu.EventsCore.0=Core 0
heltec_wifi_kit_32_V3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

heltec_wifi_kit_32_V3.menu.CPUFreq.240=240MHz (WiFi)
heltec_wifi_kit_32_V3.menu.CPUFreq.240.build.f_cpu=240000000L
heltec_wifi_kit_32_V3.menu.CPUFreq.160=160MHz (WiFi)
heltec_wifi_kit_32_V3.menu.CPUFreq.160.build.f_cpu=160000000L
heltec_wifi_kit_32_V3.menu.CPUFreq.80=80MHz (WiFi)
heltec_wifi_kit_32_V3.menu.CPUFreq.80.build.f_cpu=80000000L
heltec_wifi_kit_32_V3.menu.CPUFreq.40=40MHz
heltec_wifi_kit_32_V3.menu.CPUFreq.40.build.f_cpu=40000000L
heltec_wifi_kit_32_V3.menu.CPUFreq.20=20MHz
heltec_wifi_kit_32_V3.menu.CPUFreq.20.build.f_cpu=20000000L
heltec_wifi_kit_32_V3.menu.CPUFreq.10=10MHz
heltec_wifi_kit_32_V3.menu.CPUFreq.10.build.f_cpu=10000000L

heltec_wifi_kit_32_V3.menu.UploadSpeed.921600=921600
heltec_wifi_kit_32_V3.menu.UploadSpeed.921600.upload.speed=921600
heltec_wifi_kit_32_V3.menu.UploadSpeed.115200=115200
heltec_wifi_kit_32_V3.menu.UploadSpeed.115200.upload.speed=115200
heltec_wifi_kit_32_V3.menu.UploadSpeed.256000.windows=256000
heltec_wifi_kit_32_V3.menu.UploadSpeed.256000.upload.speed=256000
heltec_wifi_kit_32_V3.menu.UploadSpeed.230400.windows.upload.speed=256000
heltec_wifi_kit_32_V3.menu.UploadSpeed.230400=230400
heltec_wifi_kit_32_V3.menu.UploadSpeed.230400.upload.speed=230400
heltec_wifi_kit_32_V3.menu.UploadSpeed.460800.linux=460800
heltec_wifi_kit_32_V3.menu.UploadSpeed.460800.macosx=460800
heltec_wifi_kit_32_V3.menu.UploadSpeed.460800.upload.speed=460800
heltec_wifi_kit_32_V3.menu.UploadSpeed.512000.windows=512000
heltec_wifi_kit_32_V3.menu.UploadSpeed.512000.upload.speed=512000

heltec_wifi_kit_32_V3.menu.DebugLevel.none=None
heltec_wifi_kit_32_V3.menu.DebugLevel.none.build.code_debug=0
heltec_wifi_kit_32_V3.menu.DebugLevel.error=Error
heltec_wifi_kit_32_V3.menu.DebugLevel.error.build.code_debug=1
heltec_wifi_kit_32_V3.menu.DebugLevel.warn=Warn
heltec_wifi_kit_32_V3.menu.DebugLevel.warn.build.code_debug=2
heltec_wifi_kit_32_V3.menu.DebugLevel.info=Info
heltec_wifi_kit_32_V3.menu.DebugLevel.info.build.code_debug=3
heltec_wifi_kit_32_V3.menu.DebugLevel.debug=Debug
heltec_wifi_kit_32_V3.menu.DebugLevel.debug.build.code_debug=4
heltec_wifi_kit_32_V3.menu.DebugLevel.verbose=Verbose
heltec_wifi_kit_32_V3.menu.DebugLevel.verbose.build.code_debug=5

heltec_wifi_kit_32_V3.menu.EraseFlash.none=Disabled
heltec_wifi_kit_32_V3.menu.EraseFlash.none.upload.erase_cmd=
heltec_wifi_kit_32_V3.menu.EraseFlash.all=Enabled
heltec_wifi_kit_32_V3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

heltec_wifi_lora_32.name=Heltec WiFi LoRa 32

heltec_wifi_lora_32.bootloader.tool=esptool_py
heltec_wifi_lora_32.bootloader.tool.default=esptool_py

heltec_wifi_lora_32.upload.tool=esptool_py
heltec_wifi_lora_32.upload.tool.default=esptool_py
heltec_wifi_lora_32.upload.tool.network=esp_ota

heltec_wifi_lora_32.upload.maximum_size=1310720
heltec_wifi_lora_32.upload.maximum_data_size=327680
heltec_wifi_lora_32.upload.flags=
heltec_wifi_lora_32.upload.extra_flags=

heltec_wifi_lora_32.serial.disableDTR=true
heltec_wifi_lora_32.serial.disableRTS=true

heltec_wifi_lora_32.build.tarch=xtensa
heltec_wifi_lora_32.build.bootloader_addr=0x1000
heltec_wifi_lora_32.build.target=esp32
heltec_wifi_lora_32.build.mcu=esp32
heltec_wifi_lora_32.build.core=esp32
heltec_wifi_lora_32.build.variant=heltec_wifi_lora_32
heltec_wifi_lora_32.build.board=HELTEC_WIFI_LORA_32

heltec_wifi_lora_32.build.f_cpu=240000000L
heltec_wifi_lora_32.build.flash_size=4MB
heltec_wifi_lora_32.build.flash_freq=80m
heltec_wifi_lora_32.build.flash_mode=dio
heltec_wifi_lora_32.build.boot=dio
heltec_wifi_lora_32.build.partitions=default
heltec_wifi_lora_32.build.defines=-D{build.band} -DLoRaWAN_DEBUG_LEVEL={build.LoRaWanDebugLevel} -DACTIVE_REGION=LORAMAC_{build.band} {build.psram}

heltec_wifi_lora_32.menu.PartitionScheme.default=Regular 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
heltec_wifi_lora_32.menu.PartitionScheme.default.build.partitions=default
heltec_wifi_lora_32.menu.PartitionScheme.defaultffat=Regular 4MB with ffat (1.2MB APP/1.5MB FATFS)
heltec_wifi_lora_32.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
heltec_wifi_lora_32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
heltec_wifi_lora_32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
heltec_wifi_lora_32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
heltec_wifi_lora_32.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
heltec_wifi_lora_32.menu.PartitionScheme.minimal.build.partitions=minimal
heltec_wifi_lora_32.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
heltec_wifi_lora_32.menu.PartitionScheme.huge_app.build.partitions=huge_app
heltec_wifi_lora_32.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
heltec_wifi_lora_32.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
heltec_wifi_lora_32.menu.PartitionScheme.no_ota.build.partitions=no_ota
heltec_wifi_lora_32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
heltec_wifi_lora_32.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
heltec_wifi_lora_32.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
heltec_wifi_lora_32.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
heltec_wifi_lora_32.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
heltec_wifi_lora_32.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
heltec_wifi_lora_32.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
heltec_wifi_lora_32.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
heltec_wifi_lora_32.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
heltec_wifi_lora_32.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576

