espressif/arduino-esp32/boards.txt
honeylemon.upload.maximum_size=1310720
honeylemon.upload.maximum_data_size=327680
honeylemon.upload.flags=
honeylemon.upload.extra_flags=

honeylemon.serial.disableDTR=true
honeylemon.serial.disableRTS=true

honeylemon.build.tarch=xtensa
honeylemon.build.bootloader_addr=0x1000
honeylemon.build.target=esp32
honeylemon.build.mcu=esp32
honeylemon.build.core=esp32
honeylemon.build.variant=honeylemon
honeylemon.build.board=HONEYLEMON

honeylemon.build.f_cpu=240000000L
honeylemon.build.flash_mode=dio
honeylemon.build.flash_size=4MB
honeylemon.build.boot=dio
honeylemon.build.partitions=default
honeylemon.build.defines=

honeylemon.menu.FlashFreq.80=80MHz
honeylemon.menu.FlashFreq.80.build.flash_freq=80m
honeylemon.menu.FlashFreq.40=40MHz
honeylemon.menu.FlashFreq.40.build.flash_freq=40m

honeylemon.menu.UploadSpeed.921600=921600
honeylemon.menu.UploadSpeed.921600.upload.speed=921600
honeylemon.menu.UploadSpeed.115200=115200
honeylemon.menu.UploadSpeed.115200.upload.speed=115200
honeylemon.menu.UploadSpeed.256000.windows=256000
honeylemon.menu.UploadSpeed.256000.upload.speed=256000
honeylemon.menu.UploadSpeed.230400.windows.upload.speed=256000
honeylemon.menu.UploadSpeed.230400=230400
honeylemon.menu.UploadSpeed.230400.upload.speed=230400
honeylemon.menu.UploadSpeed.460800.linux=460800
honeylemon.menu.UploadSpeed.460800.macosx=460800
honeylemon.menu.UploadSpeed.460800.upload.speed=460800
honeylemon.menu.UploadSpeed.512000.windows=512000
honeylemon.menu.UploadSpeed.512000.upload.speed=512000

honeylemon.menu.DebugLevel.none=None
honeylemon.menu.DebugLevel.none.build.code_debug=0
honeylemon.menu.DebugLevel.error=Error
honeylemon.menu.DebugLevel.error.build.code_debug=1
honeylemon.menu.DebugLevel.warn=Warn
honeylemon.menu.DebugLevel.warn.build.code_debug=2
honeylemon.menu.DebugLevel.info=Info
honeylemon.menu.DebugLevel.info.build.code_debug=3
honeylemon.menu.DebugLevel.debug=Debug
honeylemon.menu.DebugLevel.debug.build.code_debug=4
honeylemon.menu.DebugLevel.verbose=Verbose
honeylemon.menu.DebugLevel.verbose.build.code_debug=5

honeylemon.menu.EraseFlash.none=Disabled
honeylemon.menu.EraseFlash.none.upload.erase_cmd=
honeylemon.menu.EraseFlash.all=Enabled
honeylemon.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

mgbot-iotik32a.name=MGBOT IOTIK 32A

mgbot-iotik32a.bootloader.tool=esptool_py
mgbot-iotik32a.bootloader.tool.default=esptool_py

mgbot-iotik32a.upload.tool=esptool_py
mgbot-iotik32a.upload.tool.default=esptool_py
mgbot-iotik32a.upload.tool.network=esp_ota

mgbot-iotik32a.upload.maximum_size=1310720
mgbot-iotik32a.upload.maximum_data_size=327680
mgbot-iotik32a.upload.flags=
mgbot-iotik32a.upload.extra_flags=

mgbot-iotik32a.serial.disableDTR=true
mgbot-iotik32a.serial.disableRTS=true

mgbot-iotik32a.build.tarch=xtensa
mgbot-iotik32a.build.bootloader_addr=0x1000
mgbot-iotik32a.build.target=esp32
mgbot-iotik32a.build.mcu=esp32
mgbot-iotik32a.build.core=esp32
mgbot-iotik32a.build.variant=mgbot-iotik32a
mgbot-iotik32a.build.board=MGBOT_IOTIK32A

mgbot-iotik32a.build.f_cpu=240000000L
mgbot-iotik32a.build.flash_size=4MB
mgbot-iotik32a.build.flash_freq=40m
mgbot-iotik32a.build.flash_mode=dio
mgbot-iotik32a.build.boot=dio
mgbot-iotik32a.build.partitions=default
mgbot-iotik32a.build.defines=

mgbot-iotik32a.menu.PSRAM.disabled=Disabled
mgbot-iotik32a.menu.PSRAM.disabled.build.defines=
mgbot-iotik32a.menu.PSRAM.disabled.build.extra_libs=
mgbot-iotik32a.menu.PSRAM.enabled=Enabled
mgbot-iotik32a.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
mgbot-iotik32a.menu.PSRAM.enabled.build.extra_libs=

mgbot-iotik32a.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
mgbot-iotik32a.menu.PartitionScheme.default.build.partitions=default
mgbot-iotik32a.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
mgbot-iotik32a.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
mgbot-iotik32a.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
mgbot-iotik32a.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
mgbot-iotik32a.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
mgbot-iotik32a.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
mgbot-iotik32a.menu.PartitionScheme.minimal.build.partitions=minimal
mgbot-iotik32a.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
mgbot-iotik32a.menu.PartitionScheme.no_ota.build.partitions=no_ota
mgbot-iotik32a.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
mgbot-iotik32a.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
mgbot-iotik32a.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
mgbot-iotik32a.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
mgbot-iotik32a.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
mgbot-iotik32a.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
mgbot-iotik32a.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
mgbot-iotik32a.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
mgbot-iotik32a.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
mgbot-iotik32a.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
mgbot-iotik32a.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
mgbot-iotik32a.menu.PartitionScheme.huge_app.build.partitions=huge_app
mgbot-iotik32a.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
mgbot-iotik32a.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
mgbot-iotik32a.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
mgbot-iotik32a.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
mgbot-iotik32a.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
mgbot-iotik32a.menu.PartitionScheme.fatflash.build.partitions=ffat
mgbot-iotik32a.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
mgbot-iotik32a.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
mgbot-iotik32a.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
mgbot-iotik32a.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

mgbot-iotik32a.menu.CPUFreq.240=240MHz (WiFi/BT)
mgbot-iotik32a.menu.CPUFreq.240.build.f_cpu=240000000L
mgbot-iotik32a.menu.CPUFreq.160=160MHz (WiFi/BT)
mgbot-iotik32a.menu.CPUFreq.160.build.f_cpu=160000000L
mgbot-iotik32a.menu.CPUFreq.80=80MHz (WiFi/BT)
mgbot-iotik32a.menu.CPUFreq.80.build.f_cpu=80000000L
mgbot-iotik32a.menu.CPUFreq.40=40MHz (40MHz XTAL)
mgbot-iotik32a.menu.CPUFreq.40.build.f_cpu=40000000L
mgbot-iotik32a.menu.CPUFreq.26=26MHz (26MHz XTAL)
mgbot-iotik32a.menu.CPUFreq.26.build.f_cpu=26000000L
mgbot-iotik32a.menu.CPUFreq.20=20MHz (40MHz XTAL)
mgbot-iotik32a.menu.CPUFreq.20.build.f_cpu=20000000L
mgbot-iotik32a.menu.CPUFreq.13=13MHz (26MHz XTAL)
mgbot-iotik32a.menu.CPUFreq.13.build.f_cpu=13000000L
mgbot-iotik32a.menu.CPUFreq.10=10MHz (40MHz XTAL)
mgbot-iotik32a.menu.CPUFreq.10.build.f_cpu=10000000L

