espressif/arduino-esp32/boards.txt
##############################################################

deneyapkart1A.name=Deneyap Kart 1A

deneyapkart1A.bootloader.tool=esptool_py
deneyapkart1A.bootloader.tool.default=esptool_py

deneyapkart1A.upload.tool=esptool_py
deneyapkart1A.upload.tool.default=esptool_py
deneyapkart1A.upload.tool.network=esp_ota

deneyapkart1A.upload.maximum_size=1310720
deneyapkart1A.upload.maximum_data_size=327680
deneyapkart1A.upload.flags=
deneyapkart1A.upload.extra_flags=

deneyapkart1A.serial.disableDTR=true
deneyapkart1A.serial.disableRTS=true

deneyapkart1A.build.tarch=xtensa
deneyapkart1A.build.bootloader_addr=0x1000
deneyapkart1A.build.target=esp32
deneyapkart1A.build.mcu=esp32
deneyapkart1A.build.core=esp32
deneyapkart1A.build.variant=deneyapkart1A
deneyapkart1A.build.board=DYDK1A

deneyapkart1A.build.f_cpu=240000000L
deneyapkart1A.build.flash_size=4MB
deneyapkart1A.build.flash_freq=80m
deneyapkart1A.build.flash_mode=dio
deneyapkart1A.build.boot=qio
deneyapkart1A.build.partitions=default
deneyapkart1A.build.defines=
deneyapkart1A.build.loop_core=
deneyapkart1A.build.event_core=

## IDE 2.0 Seems to not update the value
deneyapkart1A.menu.JTAGAdapter.default=Disabled
deneyapkart1A.menu.JTAGAdapter.default.build.copy_jtag_files=0
deneyapkart1A.menu.JTAGAdapter.external=FTDI Adapter
deneyapkart1A.menu.JTAGAdapter.external.build.openocdscript=esp32-wrover-kit-3.3v.cfg
deneyapkart1A.menu.JTAGAdapter.external.build.copy_jtag_files=1
deneyapkart1A.menu.JTAGAdapter.bridge=ESP USB Bridge
deneyapkart1A.menu.JTAGAdapter.bridge.build.openocdscript=esp32-bridge.cfg
deneyapkart1A.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

deneyapkart1A.menu.PSRAM.enabled=Enabled
deneyapkart1A.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
deneyapkart1A.menu.PSRAM.enabled.build.extra_libs=
deneyapkart1A.menu.PSRAM.disabled=Disabled
deneyapkart1A.menu.PSRAM.disabled.build.defines=
deneyapkart1A.menu.PSRAM.disabled.build.extra_libs=

deneyapkart1A.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
deneyapkart1A.menu.PartitionScheme.default.build.partitions=default
deneyapkart1A.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
deneyapkart1A.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
deneyapkart1A.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
deneyapkart1A.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
deneyapkart1A.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
deneyapkart1A.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
deneyapkart1A.menu.PartitionScheme.minimal.build.partitions=minimal
deneyapkart1A.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
deneyapkart1A.menu.PartitionScheme.no_ota.build.partitions=no_ota
deneyapkart1A.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
deneyapkart1A.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
deneyapkart1A.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
deneyapkart1A.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
deneyapkart1A.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
deneyapkart1A.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
deneyapkart1A.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
deneyapkart1A.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
deneyapkart1A.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
deneyapkart1A.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
deneyapkart1A.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
deneyapkart1A.menu.PartitionScheme.huge_app.build.partitions=huge_app
deneyapkart1A.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
deneyapkart1A.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
deneyapkart1A.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
deneyapkart1A.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
deneyapkart1A.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
deneyapkart1A.menu.PartitionScheme.fatflash.build.partitions=ffat
deneyapkart1A.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
deneyapkart1A.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
deneyapkart1A.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
deneyapkart1A.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
deneyapkart1A.menu.PartitionScheme.rainmaker=RainMaker
deneyapkart1A.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
deneyapkart1A.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

deneyapkart1A.menu.CPUFreq.240=240MHz (WiFi/BT)
deneyapkart1A.menu.CPUFreq.240.build.f_cpu=240000000L
deneyapkart1A.menu.CPUFreq.160=160MHz (WiFi/BT)
deneyapkart1A.menu.CPUFreq.160.build.f_cpu=160000000L
deneyapkart1A.menu.CPUFreq.80=80MHz (WiFi/BT)
deneyapkart1A.menu.CPUFreq.80.build.f_cpu=80000000L
deneyapkart1A.menu.CPUFreq.40=40MHz (40MHz XTAL)
deneyapkart1A.menu.CPUFreq.40.build.f_cpu=40000000L
deneyapkart1A.menu.CPUFreq.26=26MHz (26MHz XTAL)
deneyapkart1A.menu.CPUFreq.26.build.f_cpu=26000000L
deneyapkart1A.menu.CPUFreq.20=20MHz (40MHz XTAL)
deneyapkart1A.menu.CPUFreq.20.build.f_cpu=20000000L
deneyapkart1A.menu.CPUFreq.13=13MHz (26MHz XTAL)
deneyapkart1A.menu.CPUFreq.13.build.f_cpu=13000000L
deneyapkart1A.menu.CPUFreq.10=10MHz (40MHz XTAL)
deneyapkart1A.menu.CPUFreq.10.build.f_cpu=10000000L

deneyapkart1A.menu.FlashMode.qio=QIO
deneyapkart1A.menu.FlashMode.qio.build.flash_mode=dio
deneyapkart1A.menu.FlashMode.qio.build.boot=qio
deneyapkart1A.menu.FlashMode.dio=DIO
deneyapkart1A.menu.FlashMode.dio.build.flash_mode=dio
deneyapkart1A.menu.FlashMode.dio.build.boot=dio

deneyapkart1A.menu.FlashFreq.80=80MHz
deneyapkart1A.menu.FlashFreq.80.build.flash_freq=80m
deneyapkart1A.menu.FlashFreq.40=40MHz
deneyapkart1A.menu.FlashFreq.40.build.flash_freq=40m

deneyapkart1A.menu.FlashSize.4M=4MB (32Mb)
deneyapkart1A.menu.FlashSize.4M.build.flash_size=4MB
deneyapkart1A.menu.FlashSize.8M=8MB (64Mb)
deneyapkart1A.menu.FlashSize.8M.build.flash_size=8MB
deneyapkart1A.menu.FlashSize.8M.build.partitions=default_8MB
deneyapkart1A.menu.FlashSize.2M=2MB (16Mb)
deneyapkart1A.menu.FlashSize.2M.build.flash_size=2MB
deneyapkart1A.menu.FlashSize.2M.build.partitions=minimal
deneyapkart1A.menu.FlashSize.16M=16MB (128Mb)
deneyapkart1A.menu.FlashSize.16M.build.flash_size=16MB

deneyapkart1A.menu.UploadSpeed.921600=921600
deneyapkart1A.menu.UploadSpeed.921600.upload.speed=921600
deneyapkart1A.menu.UploadSpeed.115200=115200
deneyapkart1A.menu.UploadSpeed.115200.upload.speed=115200
deneyapkart1A.menu.UploadSpeed.256000.windows=256000
deneyapkart1A.menu.UploadSpeed.256000.upload.speed=256000
deneyapkart1A.menu.UploadSpeed.230400.windows.upload.speed=256000
deneyapkart1A.menu.UploadSpeed.230400=230400
deneyapkart1A.menu.UploadSpeed.230400.upload.speed=230400
deneyapkart1A.menu.UploadSpeed.460800.linux=460800
deneyapkart1A.menu.UploadSpeed.460800.macosx=460800
deneyapkart1A.menu.UploadSpeed.460800.upload.speed=460800
deneyapkart1A.menu.UploadSpeed.512000.windows=512000
deneyapkart1A.menu.UploadSpeed.512000.upload.speed=512000

deneyapkart1A.menu.LoopCore.1=Core 1
deneyapkart1A.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
deneyapkart1A.menu.LoopCore.0=Core 0
deneyapkart1A.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

deneyapkart1A.menu.EventsCore.1=Core 1
deneyapkart1A.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
deneyapkart1A.menu.EventsCore.0=Core 0
deneyapkart1A.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

deneyapkart1A.menu.DebugLevel.none=None
deneyapkart1A.menu.DebugLevel.none.build.code_debug=0
deneyapkart1A.menu.DebugLevel.error=Error
deneyapkart1A.menu.DebugLevel.error.build.code_debug=1
deneyapkart1A.menu.DebugLevel.warn=Warn
deneyapkart1A.menu.DebugLevel.warn.build.code_debug=2
deneyapkart1A.menu.DebugLevel.info=Info
deneyapkart1A.menu.DebugLevel.info.build.code_debug=3
deneyapkart1A.menu.DebugLevel.debug=Debug
deneyapkart1A.menu.DebugLevel.debug.build.code_debug=4
deneyapkart1A.menu.DebugLevel.verbose=Verbose
deneyapkart1A.menu.DebugLevel.verbose.build.code_debug=5

deneyapkart1A.menu.EraseFlash.none=Disabled
deneyapkart1A.menu.EraseFlash.none.upload.erase_cmd=
deneyapkart1A.menu.EraseFlash.all=Enabled
deneyapkart1A.menu.EraseFlash.all.upload.erase_cmd=-e

