espressif/arduino-esp32/boards.txt
gen4-ESP32-S3R8n16.menu.MSCOnBoot.default=Disabled
gen4-ESP32-S3R8n16.menu.MSCOnBoot.default.build.msc_on_boot=0
gen4-ESP32-S3R8n16.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
gen4-ESP32-S3R8n16.menu.MSCOnBoot.msc.build.msc_on_boot=1

gen4-ESP32-S3R8n16.menu.DFUOnBoot.default=Disabled
gen4-ESP32-S3R8n16.menu.DFUOnBoot.default.build.dfu_on_boot=0
gen4-ESP32-S3R8n16.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
gen4-ESP32-S3R8n16.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

gen4-ESP32-S3R8n16.menu.UploadMode.default=UART0 / Hardware CDC
gen4-ESP32-S3R8n16.menu.UploadMode.default.upload.use_1200bps_touch=false
gen4-ESP32-S3R8n16.menu.UploadMode.default.upload.wait_for_upload_port=false
gen4-ESP32-S3R8n16.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
gen4-ESP32-S3R8n16.menu.UploadMode.cdc.upload.use_1200bps_touch=true
gen4-ESP32-S3R8n16.menu.UploadMode.cdc.upload.wait_for_upload_port=true

gen4-ESP32-S3R8n16.menu.PartitionScheme.gen4esp32scheme1=Small App w/ OTA + Huge FS (2MB APP/2MB OTA/12MB SPIFFS)
gen4-ESP32-S3R8n16.menu.PartitionScheme.gen4esp32scheme1.build.custom_partitions=gen4esp32_2MBapp_2MBota_12MBspiffs
gen4-ESP32-S3R8n16.menu.PartitionScheme.gen4esp32scheme1.upload.maximum_size=2097152
gen4-ESP32-S3R8n16.menu.PartitionScheme.gen4esp32scheme2=Medium App w/ OTA + Large FS (4MB APP/4MB OTA/7MB SPIFFS)
gen4-ESP32-S3R8n16.menu.PartitionScheme.gen4esp32scheme2.build.custom_partitions=gen4esp32_4MBapp_4MBota_7MBspiffs
gen4-ESP32-S3R8n16.menu.PartitionScheme.gen4esp32scheme2.upload.maximum_size=4718592
gen4-ESP32-S3R8n16.menu.PartitionScheme.gen4esp32scheme3=Large App w/ OTA (8MB APP/8MB OTA)
gen4-ESP32-S3R8n16.menu.PartitionScheme.gen4esp32scheme3.build.custom_partitions=gen4esp32_8MBapp_8MBota
gen4-ESP32-S3R8n16.menu.PartitionScheme.gen4esp32scheme3.upload.maximum_size=8323072
gen4-ESP32-S3R8n16.menu.PartitionScheme.gen4esp32scheme4=Huge App (16MB APP)
gen4-ESP32-S3R8n16.menu.PartitionScheme.gen4esp32scheme4.build.custom_partitions=gen4esp32_16MBapp
gen4-ESP32-S3R8n16.menu.PartitionScheme.gen4esp32scheme4.upload.maximum_size=16646144

gen4-ESP32-S3R8n16.menu.CPUFreq.240=240MHz (WiFi)
gen4-ESP32-S3R8n16.menu.CPUFreq.240.build.f_cpu=240000000L
gen4-ESP32-S3R8n16.menu.CPUFreq.160=160MHz (WiFi)
gen4-ESP32-S3R8n16.menu.CPUFreq.160.build.f_cpu=160000000L
gen4-ESP32-S3R8n16.menu.CPUFreq.80=80MHz (WiFi)
gen4-ESP32-S3R8n16.menu.CPUFreq.80.build.f_cpu=80000000L
gen4-ESP32-S3R8n16.menu.CPUFreq.40=40MHz
gen4-ESP32-S3R8n16.menu.CPUFreq.40.build.f_cpu=40000000L
gen4-ESP32-S3R8n16.menu.CPUFreq.20=20MHz
gen4-ESP32-S3R8n16.menu.CPUFreq.20.build.f_cpu=20000000L
gen4-ESP32-S3R8n16.menu.CPUFreq.10=10MHz
gen4-ESP32-S3R8n16.menu.CPUFreq.10.build.f_cpu=10000000L

gen4-ESP32-S3R8n16.menu.UploadSpeed.921600=921600
gen4-ESP32-S3R8n16.menu.UploadSpeed.921600.upload.speed=921600
gen4-ESP32-S3R8n16.menu.UploadSpeed.115200=115200
gen4-ESP32-S3R8n16.menu.UploadSpeed.115200.upload.speed=115200
gen4-ESP32-S3R8n16.menu.UploadSpeed.256000.windows=256000
gen4-ESP32-S3R8n16.menu.UploadSpeed.256000.upload.speed=256000
gen4-ESP32-S3R8n16.menu.UploadSpeed.230400.windows.upload.speed=256000
gen4-ESP32-S3R8n16.menu.UploadSpeed.230400=230400
gen4-ESP32-S3R8n16.menu.UploadSpeed.230400.upload.speed=230400
gen4-ESP32-S3R8n16.menu.UploadSpeed.460800.linux=460800
gen4-ESP32-S3R8n16.menu.UploadSpeed.460800.macosx=460800
gen4-ESP32-S3R8n16.menu.UploadSpeed.460800.upload.speed=460800
gen4-ESP32-S3R8n16.menu.UploadSpeed.512000.windows=512000
gen4-ESP32-S3R8n16.menu.UploadSpeed.512000.upload.speed=512000

gen4-ESP32-S3R8n16.menu.DebugLevel.none=None
gen4-ESP32-S3R8n16.menu.DebugLevel.none.build.code_debug=0
gen4-ESP32-S3R8n16.menu.DebugLevel.error=Error
gen4-ESP32-S3R8n16.menu.DebugLevel.error.build.code_debug=1
gen4-ESP32-S3R8n16.menu.DebugLevel.warn=Warn
gen4-ESP32-S3R8n16.menu.DebugLevel.warn.build.code_debug=2
gen4-ESP32-S3R8n16.menu.DebugLevel.info=Info
gen4-ESP32-S3R8n16.menu.DebugLevel.info.build.code_debug=3
gen4-ESP32-S3R8n16.menu.DebugLevel.debug=Debug
gen4-ESP32-S3R8n16.menu.DebugLevel.debug.build.code_debug=4
gen4-ESP32-S3R8n16.menu.DebugLevel.verbose=Verbose
gen4-ESP32-S3R8n16.menu.DebugLevel.verbose.build.code_debug=5

gen4-ESP32-S3R8n16.menu.EraseFlash.none=Disabled
gen4-ESP32-S3R8n16.menu.EraseFlash.none.upload.erase_cmd=
gen4-ESP32-S3R8n16.menu.EraseFlash.all=Enabled
gen4-ESP32-S3R8n16.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
# Namino Rosso

namino_rosso.name=Namino Rosso
namino_rosso.vid.0=0x303a
namino_rosso.pid.0=0x1001

namino_rosso.bootloader.tool=esptool_py
namino_rosso.bootloader.tool.default=esptool_py

namino_rosso.upload.tool=esptool_py
namino_rosso.upload.tool.default=esptool_py
namino_rosso.upload.tool.network=esp_ota

namino_rosso.upload.maximum_size=1310720
namino_rosso.upload.maximum_data_size=327680
namino_rosso.upload.flags=
namino_rosso.upload.extra_flags=
namino_rosso.upload.use_1200bps_touch=true
namino_rosso.upload.wait_for_upload_port=true

namino_rosso.serial.disableDTR=false
namino_rosso.serial.disableRTS=false

namino_rosso.build.tarch=xtensa
namino_rosso.build.bootloader_addr=0x0
namino_rosso.build.target=esp32s3
namino_rosso.build.mcu=esp32s3
namino_rosso.build.core=esp32
namino_rosso.build.variant=namino_rosso
namino_rosso.build.board=NAMINO_ROSSO

namino_rosso.build.usb_mode=0
namino_rosso.build.cdc_on_boot=1
namino_rosso.build.msc_on_boot=0
namino_rosso.build.dfu_on_boot=0
namino_rosso.build.f_cpu=240000000L
namino_rosso.build.flash_size=4MB
namino_rosso.build.flash_freq=80m
namino_rosso.build.flash_mode=dio
namino_rosso.build.boot=qio
namino_rosso.build.partitions=default
namino_rosso.build.defines=
namino_rosso.build.loop_core=
namino_rosso.build.event_core=
namino_rosso.build.flash_type=qio
namino_rosso.build.psram_type=qspi
namino_rosso.build.memory_type={build.flash_type}_{build.psram_type}

namino_rosso.menu.LoopCore.1=Core 1
namino_rosso.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
namino_rosso.menu.LoopCore.0=Core 0
namino_rosso.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

namino_rosso.menu.EventsCore.1=Core 1
namino_rosso.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
namino_rosso.menu.EventsCore.0=Core 0
namino_rosso.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

namino_rosso.menu.USBMode.default=USB-OTG (TinyUSB)
namino_rosso.menu.USBMode.default.build.usb_mode=0
namino_rosso.menu.USBMode.hwcdc=Hardware CDC and JTAG
namino_rosso.menu.USBMode.hwcdc.build.usb_mode=1

namino_rosso.menu.CDCOnBoot.cdc=Enabled
namino_rosso.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
namino_rosso.menu.CDCOnBoot.default=Disabled
namino_rosso.menu.CDCOnBoot.default.build.cdc_on_boot=0

namino_rosso.menu.MSCOnBoot.default=Disabled
namino_rosso.menu.MSCOnBoot.default.build.msc_on_boot=0
namino_rosso.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
namino_rosso.menu.MSCOnBoot.msc.build.msc_on_boot=1

namino_rosso.menu.DFUOnBoot.default=Disabled
namino_rosso.menu.DFUOnBoot.default.build.dfu_on_boot=0
namino_rosso.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
namino_rosso.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

namino_rosso.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
namino_rosso.menu.UploadMode.cdc.upload.use_1200bps_touch=true
namino_rosso.menu.UploadMode.cdc.upload.wait_for_upload_port=true
namino_rosso.menu.UploadMode.default=UART0 / Hardware CDC
namino_rosso.menu.UploadMode.default.upload.use_1200bps_touch=false
namino_rosso.menu.UploadMode.default.upload.wait_for_upload_port=false

namino_rosso.menu.PSRAM.disabled=Disabled
namino_rosso.menu.PSRAM.disabled.build.defines=
namino_rosso.menu.PSRAM.disabled.build.psram_type=qspi
namino_rosso.menu.PSRAM.enabled=QSPI PSRAM
namino_rosso.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
namino_rosso.menu.PSRAM.enabled.build.psram_type=qspi
namino_rosso.menu.PSRAM.opi=OPI PSRAM
namino_rosso.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
namino_rosso.menu.PSRAM.opi.build.psram_type=opi

namino_rosso.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
namino_rosso.menu.PartitionScheme.default.build.partitions=default
namino_rosso.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
namino_rosso.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
namino_rosso.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
namino_rosso.menu.PartitionScheme.minimal.build.partitions=minimal
namino_rosso.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
namino_rosso.menu.PartitionScheme.no_ota.build.partitions=no_ota
namino_rosso.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
namino_rosso.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
namino_rosso.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
namino_rosso.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
namino_rosso.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
namino_rosso.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
namino_rosso.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
namino_rosso.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
namino_rosso.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
namino_rosso.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
namino_rosso.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
namino_rosso.menu.PartitionScheme.huge_app.build.partitions=huge_app
namino_rosso.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
namino_rosso.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
namino_rosso.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
namino_rosso.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

